-- MySQL dump 10.16  Distrib 10.1.48-MariaDB, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: db
-- ------------------------------------------------------
-- Server version	10.1.48-MariaDB-0+deb9u2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table dbo.dim_cash_register
--

DROP TABLE IF EXISTS dbo.dim_cash_register;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_cash_register (
  cash_register_id tinyint(4) DEFAULT NULL,
  cash_register_number varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_cash_register
--

LOCK TABLES dbo.dim_cash_register WRITE;
/*!40000 ALTER TABLE dbo.dim_cash_register DISABLE KEYS */;
INSERT INTO dbo.dim_cash_register VALUES (7,'касса - 7'),(1,'касса - 1'),(2,'касса - 2'),(3,'касса - 3'),(4,'касса - 4'),(5,'касса - 5'),(6,'касса - 6'),(7,'касса - 7'),(8,'касса - 8'),(9,'касса - 9'),(11,'касса - 11'),(12,'касса - 12'),(13,'касса - 13'),(14,'касса - 14'),(15,'касса - 15'),(16,'касса - 16'),(17,'касса - 17'),(18,'касса - 18'),(19,'касса - 19'),(20,'касса - 20'),(21,'касса - 21'),(22,'касса - 22'),(23,'касса - 23');
/*!40000 ALTER TABLE dbo.dim_cash_register ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table dbo.dim_date
--

DROP TABLE IF EXISTS dbo.dim_date;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_date (
  d varchar(19) DEFAULT NULL,
  did int(11) DEFAULT NULL,
  td varchar(10) DEFAULT NULL,
  y smallint(6) DEFAULT NULL,
  ty smallint(6) DEFAULT NULL,
  q mediumint(9) DEFAULT NULL,
  tq varchar(9) DEFAULT NULL,
  tqid varchar(10) DEFAULT NULL,
  m mediumint(9) DEFAULT NULL,
  tm varchar(8) DEFAULT NULL,
  tmid varchar(13) DEFAULT NULL,
  tms tinyint(4) DEFAULT NULL,
  w mediumint(9) DEFAULT NULL,
  tw varchar(12) DEFAULT NULL,
  twid varchar(17) DEFAULT NULL,
  dw tinyint(4) DEFAULT NULL,
  tdw varchar(11) DEFAULT NULL,
  day_type_id tinyint(4) DEFAULT NULL,
  day_type varchar(8) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_date
--

LOCK TABLES dbo.dim_date WRITE;
/*!40000 ALTER TABLE dbo.dim_date DISABLE KEYS */;
INSERT INTO dbo.dim_date VALUES ('2015-01-01 00:00:00',20150101,'01.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-02 00:00:00',20150102,'02.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-03 00:00:00',20150103,'03.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',6,'Суббота',2,'Выходной'),('2015-01-04 00:00:00',20150104,'04.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-05 00:00:00',20150105,'05.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-06 00:00:00',20150106,'06.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-07 00:00:00',20150107,'07.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',3,'Среда',1,'Рабочий'),('2015-01-08 00:00:00',20150108,'08.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-09 00:00:00',20150109,'09.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-10 00:00:00',20150110,'10.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',6,'Суббота',2,'Выходной'),('2015-01-11 00:00:00',20150111,'11.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-12 00:00:00',20150112,'12.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-13 00:00:00',20150113,'13.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-14 00:00:00',20150114,'14.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',3,'Среда',1,'Рабочий'),('2015-01-15 00:00:00',20150115,'15.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-16 00:00:00',20150116,'16.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-17 00:00:00',20150117,'17.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',6,'Суббота',2,'Выходной'),('2015-01-18 00:00:00',20150118,'18.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-19 00:00:00',20150119,'19.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-20 00:00:00',20150120,'20.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-21 00:00:00',20150121,'21.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',3,'Среда',1,'Рабочий'),('2015-01-22 00:00:00',20150122,'22.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-23 00:00:00',20150123,'23.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-24 00:00:00',20150124,'24.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',6,'Суббота',2,'Выходной'),('2015-01-25 00:00:00',20150125,'25.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-26 00:00:00',20150126,'26.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-27 00:00:00',20150127,'27.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-28 00:00:00',20150128,'28.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',3,'Среда',1,'Рабочий'),('2015-01-29 00:00:00',20150129,'29.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-30 00:00:00',20150130,'30.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-31 00:00:00',20150131,'31.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',6,'Суббота',2,'Выходной'),('2015-02-01 00:00:00',20150201,'01.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201505,'04    Неделя','2015/04    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-02 00:00:00',20150202,'02.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-03 00:00:00',20150203,'03.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-04 00:00:00',20150204,'04.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',3,'Среда',1,'Рабочий'),('2015-02-05 00:00:00',20150205,'05.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-06 00:00:00',20150206,'06.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-07 00:00:00',20150207,'07.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',6,'Суббота',2,'Выходной'),('2015-02-08 00:00:00',20150208,'08.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-09 00:00:00',20150209,'09.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-10 00:00:00',20150210,'10.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-11 00:00:00',20150211,'11.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',3,'Среда',1,'Рабочий'),('2015-02-12 00:00:00',20150212,'12.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-13 00:00:00',20150213,'13.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-14 00:00:00',20150214,'14.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',6,'Суббота',2,'Выходной'),('2015-02-15 00:00:00',20150215,'15.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-16 00:00:00',20150216,'16.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-17 00:00:00',20150217,'17.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-18 00:00:00',20150218,'18.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',3,'Среда',1,'Рабочий'),('2015-02-19 00:00:00',20150219,'19.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-20 00:00:00',20150220,'20.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-21 00:00:00',20150221,'21.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',6,'Суббота',2,'Выходной'),('2015-02-22 00:00:00',20150222,'22.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-23 00:00:00',20150223,'23.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-24 00:00:00',20150224,'24.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-25 00:00:00',20150225,'25.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',3,'Среда',1,'Рабочий'),('2015-02-26 00:00:00',20150226,'26.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-27 00:00:00',20150227,'27.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-28 00:00:00',20150228,'28.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',6,'Суббота',2,'Выходной'),('2015-03-01 00:00:00',20150301,'01.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201509,'08    Неделя','2015/08    Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-02 00:00:00',20150302,'02.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-03 00:00:00',20150303,'03.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',2,'Вторник',1,'Рабочий'),('2015-03-04 00:00:00',20150304,'04.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',3,'Среда',1,'Рабочий'),('2015-03-05 00:00:00',20150305,'05.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',4,'Четверг',1,'Рабочий'),('2015-03-06 00:00:00',20150306,'06.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',5,'Пятница',1,'Рабочий'),('2015-03-07 00:00:00',20150307,'07.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',6,'Суббота',2,'Выходной'),('2015-03-08 00:00:00',20150308,'08.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-09 00:00:00',20150309,'09.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-10 00:00:00',20150310,'10.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',2,'Вторник',1,'Рабочий'),('2015-03-11 00:00:00',20150311,'11.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',3,'Среда',1,'Рабочий'),('2015-03-12 00:00:00',20150312,'12.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',4,'Четверг',1,'Рабочий'),('2015-03-13 00:00:00',20150313,'13.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',5,'Пятница',1,'Рабочий'),('2015-03-14 00:00:00',20150314,'14.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',6,'Суббота',2,'Выходной'),('2015-03-15 00:00:00',20150315,'15.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-16 00:00:00',20150316,'16.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-17 00:00:00',20150317,'17.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',2,'Вторник',1,'Рабочий'),('2015-03-18 00:00:00',20150318,'18.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',3,'Среда',1,'Рабочий'),('2015-03-19 00:00:00',20150319,'19.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',4,'Четверг',1,'Рабочий'),('2015-03-20 00:00:00',20150320,'20.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',5,'Пятница',1,'Рабочий'),('2015-03-21 00:00:00',20150321,'21.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',6,'Суббота',2,'Выходной'),('2015-03-22 00:00:00',20150322,'22.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-23 00:00:00',20150323,'23.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-24 00:00:00',20150324,'24.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',2,'Вторник',1,'Рабочий'),('2015-03-25 00:00:00',20150325,'25.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',3,'Среда',1,'Рабочий'),('2015-03-26 00:00:00',20150326,'26.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',4,'Четверг',1,'Рабочий'),('2015-03-27 00:00:00',20150327,'27.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',5,'Пятница',1,'Рабочий'),('2015-03-28 00:00:00',20150328,'28.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',6,'Суббота',2,'Выходной'),('2015-03-29 00:00:00',20150329,'29.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-30 00:00:00',20150330,'30.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201514,'13   Неделя','2015/13   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-31 00:00:00',20150331,'31.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201514,'13   Неделя','2015/13   Неделя',2,'Вторник',1,'Рабочий'),('2015-04-01 00:00:00',20150401,'01.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',3,'Среда',1,'Рабочий'),('2015-04-02 00:00:00',20150402,'02.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',4,'Четверг',1,'Рабочий'),('2015-04-03 00:00:00',20150403,'03.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',5,'Пятница',1,'Рабочий'),('2015-04-04 00:00:00',20150404,'04.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',6,'Суббота',2,'Выходной'),('2015-04-05 00:00:00',20150405,'05.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',7,'Воскресенье',2,'Выходной'),('2015-04-06 00:00:00',20150406,'06.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',1,'Понедельник',1,'Рабочий'),('2015-04-07 00:00:00',20150407,'07.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',2,'Вторник',1,'Рабочий'),('2015-04-08 00:00:00',20150408,'08.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',3,'Среда',1,'Рабочий'),('2015-04-09 00:00:00',20150409,'09.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',4,'Четверг',1,'Рабочий'),('2015-04-10 00:00:00',20150410,'10.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',5,'Пятница',1,'Рабочий');
/*!40000 ALTER TABLE dbo.dim_date ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table dbo.dim_goods
--

DROP TABLE IF EXISTS dbo.dim_goods;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_goods (
  good_id mediumint(9) DEFAULT NULL,
  good_name varchar(144) DEFAULT NULL,
  group_id varchar(3) DEFAULT NULL,
  group_name varchar(109) DEFAULT NULL,
  parent_group_id varchar(2) DEFAULT NULL,
  parent_group_name varchar(33) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_goods
--

LOCK TABLES dbo.dim_goods WRITE;
/*!40000 ALTER TABLE dbo.dim_goods DISABLE KEYS */;
INSERT INTO dbo.dim_goods VALUES (245427,'Виши део-ролик д/очень чувствит кожи 50мл','5','Косметические средства','',''),(102018,'Фиточай Алтайский кедр клетчатка алтайская 90х60х90 с медом 10г №15','1','Биологически активные добавки','',''),(1553,'Сироп боярышник с черноплодной рябиной на сахаре 250мл','1','Биологически активные добавки','',''),(113548,'Натура сиберика крем д/ног д/ежедневного ухода 75мл питательный увлажн  (280)','5','Косметические средства','',''),(149074,'З/паста детская Новый жемчуг женьшень 50мл','5','Косметические средства','',''),(93697,'Доктор Конфеткин с бифидобактериями 100г банан','2','Продукты питания','',''),(296413,'Эспумизан беби капли внутр. 100мг/мл 30мл №1','14','Лек. средства','',''),(309294,'Дюкрэ скванорм набор:шампунь от жирной перхоти 200мл+лосьон от перхоти 30мл','5','Косметические средства','',''),(218391,'Ко-Диротон таб. 10мг+12,5мг №30','14','Лек. средства','',''),(194687,'Освежитель д/полости рта Минторол лимон+ 25мл','5','Косметические средства','',''),(89844,'Африн экстро спрей наз. 0,05% 15мл','14','Лек. средства','',''),(29615,'Соль д/ванн мертвого моря крепкий иммунитет 530г','5','Косметические средства','',''),(40378,'Фенистил пенцивир крем 1% 2г','14','Лек. средства','',''),(341027,'Презервативы Дюрекс инвизибл ультратонкие №18','7','Контрацептивные средства','',''),(250124,'Аугментин пор. д/сусп.внутр. 125мг+31,25мг/5мл 11,5г 100мл №1','14','Лек. средства','',''),(7706,'ДП гербер пюре банан-лесные ягоды 130г 5+мес','138','Детское питание','',''),(94696,'ДП хайнц каша б/мол первая овсяная-пребиотики 180г 5+мес','138','Детское питание','',''),(194747,'Масло кедровое капс. 300мг №100','1','Биологически активные добавки','',''),(320380,'Турбослим батончик диетич клубничный чизкейк 50г','2','Продукты питания','',''),(223243,'Бинт марлевый стер 7мх14см  (инд уп)','3','Изделия медицинского назначения','',''),(260827,'Кармолис гель 145г','14','Лек. средства','',''),(205570,'Клостерфрау Мелисана эликсир 95мл','14','Лек. средства','',''),(59230,'ДП хайнц детское печеньице 6 злаков 180г  (6+мес)','138','Детское питание','',''),(243154,'Масло эфирное сосна 10мл','98','Ароматерапия','',''),(234329,'Натура сиберика вилд крем д/рук подснежник защитный 75мл','5','Косметические средства','',''),(276825,'Динолак эмульс.внутр. 200мл  (+мерн стак)','1','Биологически активные добавки','',''),(297532,'Хозтовары Тиамо губка д/тела массаж оригинал круг радуга поролон','13','Хозтовары','6','Товары неаптечного ассортимента'),(19588,'Паглюферал 3 таб. №20','14','Лек. средства','',''),(49203,'Термометр мед электрон DT-624+держатель корова','3','Изделия медицинского назначения','',''),(34407,'Драй-драй бальзам от перхоти 100мл','5','Косметические средства','',''),(36322,'Кальция глюконат р-р в/в и в/м 10% 10мл №10','14','Лек. средства','',''),(105639,'Фиточай Похудей манго 2г №30','1','Биологически активные добавки','',''),(105782,'Марля медицинская 2мх90см','3','Изделия медицинского назначения','',''),(63143,'5D 5 дней крем д/ног заживляющий масло чайного дерева 30г','5','Косметические средства','',''),(77962,'Бинт марлевый стер 10мх16см','3','Изделия медицинского назначения','',''),(296473,'Вайтсорб таб. №10','72','БАД,влиющие на процесс детоксикации,сорбенты','1','Биологически активные добавки'),(175955,'Эвкасепт капли наз. 10мл','14','Лек. средства','',''),(162954,'Фурацилин р-р д/местн. и наружн. прим. 0,02% 200мл №1','14','Лек. средства','',''),(63286,'Ихтиол мазь 10% 30г','14','Лек. средства','',''),(197601,'З/паста Элмекс защита от кариеса 75мл','5','Косметические средства','',''),(233127,'Натрия хлорид р-р д/инф. 0,9% 400мл №12','14','Лек. средства','',''),(190774,'Урьяж ксемоз крем эмольянт 200мл','5','Косметические средства','',''),(148135,'Контейнер-таблетница пилюля с делителем  (1557)','3','Изделия медицинского назначения','',''),(56316,'Зубочистки с нитью ментол №10','5','Косметические средства','',''),(199539,'Клоран лосьон д/снятия водостойкого макияжа с глаз 100мл василек  (06315)','5','Косметические средства','',''),(297412,'Нивея сан спрей солнцезащитный защита и прохлада spf30 200мл  (80476)','5','Косметические средства','',''),(86847,'Тербинафин-МФФ мазь 1% 15г','14','Лек. средства','',''),(146160,'Мыло Цветы любви сирень 90г','5','Косметические средства','',''),(76167,'Грелка термохимическая солевая лор','3','Изделия медицинского назначения','',''),(61168,'Натура сиберика гель д/душа тонизирующий 400мл  (808)','5','Косметические средства','',''),(295414,'Ментос др. жев. 16г мята','2','Продукты питания','',''),(68138,'Авен клинанс К крем себо- и кераторегулирующий 40мл  (C04290)','5','Косметические средства','',''),(36525,'Презервативы Маскулан 1 ультра тутти фрутти №10','7','Контрацептивные средства','',''),(262945,'Авент соска силикон переменный поток 3+мес №2  (80600/SCF635/27)','4','Товары для мамы и малыша','',''),(12761,'Актовегин р-р д/ин. 40мг/мл 10мл №5','14','Лек. средства','',''),(75964,'Антигриппин-максимум капс./комплект №20','14','Лек. средства','',''),(252918,'Глина черная вулканическая 75г','5','Косметические средства','',''),(207568,'Амосин пор. д/сусп.внутр. 500мг №10','14','Лек. средства','',''),(796,'Лайно гель д/душа персик 200мл','5','Косметические средства','',''),(295617,'Триметазидин МВ таб.пролонг.п.п.о. 35мг №30','14','Лек. средства','',''),(135254,'Органик шоп соль д/ванн коралловые водоросли 250мл','5','Косметические средства','',''),(224362,'5D 5 дней ср-во д/стоп от пота и запаха 1,5г №10','5','Косметические средства','',''),(177750,'Биокрим масло д/загара цветочная фантазия 150мл','5','Косметические средства','',''),(74905,'Вода минеральная Ессентуки N17 500мл  (газ стекло)','2','Продукты питания','',''),(309354,'Витэкс идеальное отбеливание крем дневной spf 20 50мл','5','Косметические средства','',''),(308438,'Тест на беременность Клиаблу easy №1','3','Изделия медицинского назначения','',''),(161099,'Меллер конфета жев Шоколад-мята 38г','2','Продукты питания','',''),(179868,'АЦЦ гран. д/р-ра внутр. 600мг 3г №6','14','Лек. средства','',''),(284734,'Масло эфирное иланг-иланг 10мл','98','Ароматерапия','',''),(297592,'З/паста Колгейт тотал 12 про здоровое дыхание 75мл','105','Средства ухода за полостью рта','5','Косметические средства'),(341170,'ДНЦ крем-концентрат воск д/рук 80мл','5','Косметические средства','',''),(18589,'Преднизолон Никомед р-р д/ин. 25мг/мл 1мл №3','14','Лек. средства','',''),(256831,'Нейронтин таб. п.о 600мг №100','14','Лек. средства','',''),(295534,'Обувь ортопедическая Sydney N32','3','Изделия медицинского назначения','',''),(293499,'Барсукор бальзам-крем массажный д/детей с барсучьим жиром 50мл','5','Косметические средства','',''),(6827,'ДП бабушкино лукошко сок осветлен б/сах яблоко-груша 200мл 5+мес','138','Детское питание','',''),(309414,'БиоТоника батончик энерджайзер горький апельсин 20г','2','Продукты питания','',''),(270854,'Флюкостат капс. 50мг №7','14','Лек. средства','',''),(84076,'Офлоксацин-тева таб. п.п.о. 200мг №10','14','Лек. средства','',''),(290645,'Система д/переливания инфузионных растворов','3','Изделия медицинского назначения','',''),(320297,'Прокладки Олвейс платинум ультра нормал плюс N8','8','Товары санитарии и личной гигиены','',''),(295474,'Обувь ортопедическая Forli N24','3','Изделия медицинского назначения','',''),(341087,'Бандаж послеоперационный абдоминальный БПАШ XXL широкий 25см  (116-128см)','3','Изделия медицинского назначения','',''),(91819,'Орунгамин капс. 100мг №15','14','Лек. средства','',''),(111550,'Мовалис р-р в/м 15мг/1,5мл 1,5мл №3','14','Лек. средства','',''),(25582,'Пантенол Виал спрей бальзам косметический 58г','5','Косметические средства','',''),(92901,'Комплимент натуралис молочко д/лица антивозрастной виноград-масло пшеницы 250мл','5','Косметические средства','',''),(294498,'Беруши (вкладыши ушные) Макс акваблок от воды N2 рельефные прозрачные','3','Изделия медицинского назначения','',''),(131401,'Нэйчес баунти омега-3 капс. 980мг №30','1','Биологически активные добавки','',''),(19611,'Женьшень настойка 25мл','14','Лек. средства','',''),(271793,'Тромбовазим капс. 800ЕД №30','14','Лек. средства','',''),(166071,'Биодерма нодэ шампунь 400мл','5','Косметические средства','',''),(53199,'Виши тан идеаль/teint ideal крем тональный 25 30мл  (M7766100)','5','Косметические средства','',''),(40498,'Амброксол Врамед сироп 15мг/5мл 100мл №1','14','Лек. средства','',''),(122493,'Акку-чек актив глюкометр набор+тест-полоски N10','3','Изделия медицинского назначения','',''),(286566,'Бипрол таб. п.п.о. 10мг №30','14','Лек. средства','',''),(157163,'Зингер триммер  (zo-SLС-703)','6','Товары неаптечного ассортимента','',''),(115749,'Баня сауна массаж гель-душ+шампунь березовый 300мл','5','Косметические средства','',''),(166950,'Пектилифт гель д/зрелой кожи курс 1нед 50мл','5','Косметические средства','',''),(37501,'Мыло невское 4х100г','5','Косметические средства','','');
/*!40000 ALTER TABLE dbo.dim_goods ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table dbo.dim_stores
--

DROP TABLE IF EXISTS dbo.dim_stores;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_stores (
  store_id tinyint(4) DEFAULT NULL,
  store_name varchar(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_stores
--

LOCK TABLES dbo.dim_stores WRITE;
/*!40000 ALTER TABLE dbo.dim_stores DISABLE KEYS */;
INSERT INTO dbo.dim_stores VALUES (1,'Аптека - 1'),(2,'Аптека - 2'),(3,'Аптека - 3'),(4,'Аптека - 4'),(5,'Аптека - 5'),(6,'Аптека - 6'),(7,'Аптека - 7'),(8,'Аптека - 8'),(9,'Аптека - 9'),(10,'Аптека - 10'),(11,'Аптека - 11'),(12,'Аптека - 12'),(13,'Аптека - 13'),(14,'Аптека - 14'),(15,'Аптека - 15'),(16,'Аптека - 16'),(17,'Аптека - 17'),(18,'Аптека - 18'),(19,'Аптека - 19'),(20,'Аптека - 20'),(21,'Аптека - 21'),(22,'Аптека - 22'),(23,'Аптека - 23'),(24,'Аптека - 24'),(25,'Аптека - 25'),(26,'Аптека - 26'),(27,'Аптека - 27'),(28,'Аптека - 28'),(29,'Аптека - 29'),(30,'Аптека - 30'),(31,'Аптека - 31'),(32,'Аптека - 32'),(33,'Аптека - 33'),(34,'Аптека - 34'),(35,'Аптека - 35'),(36,'Аптека - 36'),(37,'Аптека - 37'),(38,'Аптека - 38'),(39,'Аптека - 39'),(40,'Аптека - 40'),(41,'Аптека - 41'),(42,'Аптека - 42'),(43,'Аптека - 43'),(44,'Аптека - 44'),(45,'Аптека - 45'),(46,'Аптека - 46'),(48,'Аптека - 48'),(49,'Аптека - 49'),(50,'Аптека - 50'),(51,'Аптека - 51'),(52,'Аптека - 52'),(53,'Аптека - 53'),(54,'Аптека - 54'),(55,'Аптека - 55'),(56,'Аптека - 56'),(57,'Аптека - 57'),(58,'Аптека - 58');
/*!40000 ALTER TABLE dbo.dim_stores ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table dbo.fct_cheque
--

DROP TABLE IF EXISTS dbo.fct_cheque;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.fct_cheque (
  date_id int(11) DEFAULT NULL,
  store_id tinyint(4) DEFAULT NULL,
  good_id mediumint(9) DEFAULT NULL,
  cash_register_id tinyint(4) DEFAULT NULL,
  quantity varchar(9) DEFAULT NULL,
  cost_net varchar(10) DEFAULT NULL,
  cost_grs varchar(10) DEFAULT NULL,
  sale_net varchar(10) DEFAULT NULL,
  sale_grs varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.fct_cheque
--

LOCK TABLES dbo.fct_cheque WRITE;
/*!40000 ALTER TABLE dbo.fct_cheque DISABLE KEYS */;
INSERT INTO dbo.fct_cheque VALUES (20171003,9,227133,4,'4.0000','160.9200','177.0120','247.9080','264.0000'),(20170829,9,144760,4,'1.0000','49.1364','54.0500','102.5864','107.5000'),(20170912,17,171541,6,'1.0000','93.6091','102.9700','133.6391','143.0000'),(20170729,9,124003,4,'1.0000','53.5400','58.8940','74.1460','79.5000'),(20170403,33,136177,12,'1.0000','16.5600','19.5409','47.0191','50.0000'),(20171115,33,166292,13,'1.0000','670.1455','737.1601','928.9854','996.0000'),(20170902,29,30154,11,'1.0000','136.1000','149.7100','196.3900','210.0000'),(20170915,3,148366,1,'1.0000','71.8000','78.9800','86.3200','93.5000'),(20170928,21,212635,8,'1.0000','168.3000','185.1300','238.1700','255.0000'),(20170526,25,149585,9,'2.0000','88.8800','104.8784','194.0016','210.0000'),(20171122,9,308462,4,'2.0000','34.9082','38.3990','86.5092','90.0000'),(20170307,9,189284,4,'1.0000','7.5800','8.9444','11.1356','12.5000'),(20170614,25,46226,10,'1.0000','125.7800','138.3580','182.4220','195.0000'),(20170728,33,296994,13,'1.0000','114.1277','125.5405','138.5872','150.0000'),(20170217,29,193634,11,'1.0000','249.1000','274.0100','358.5900','383.5000'),(20170202,9,199335,4,'1.0000','270.1100','297.1210','388.4890','415.5000'),(20171017,29,59997,11,'2.0000','76.2372','89.9598','136.2774','150.0000'),(20170215,21,105725,8,'3.0000','18.6600','20.5260','61.1340','63.0000'),(20171103,9,295916,4,'1.0000','123.5555','135.9110','177.6445','190.0000'),(20170103,21,211953,8,'1.0000','23.4800','25.8280','54.6520','57.0000'),(20170623,9,120383,4,'1.0000','160.4800','176.5280','230.9520','247.0000'),(20170801,21,191646,8,'1.0000','186.0600','204.6660','257.3940','276.0000'),(20170215,9,12607,4,'1.0000','33.2000','36.5200','76.6800','80.0000'),(20171025,43,114866,16,'4.0000','25.8644','30.5200','55.3444','60.0000'),(20170428,17,63606,6,'1.0000','510.9200','562.0120','707.9080','759.0000'),(20171013,3,227133,2,'1.0000','42.1900','46.4090','70.7810','75.0000'),(20170801,17,245423,7,'1.0000','107.4200','118.1620','154.2580','165.0000'),(20171019,58,127426,22,'1.0000','66.8034','78.8280','105.9754','118.0000'),(20171214,17,292311,6,'1.0000','303.6636','334.0300','435.6336','466.0000'),(20170620,25,24530,9,'1.0000','196.7500','216.4250','285.3250','305.0000'),(20170824,37,245423,14,'1.0000','107.4200','118.1620','174.2580','185.0000'),(20170804,3,122882,1,'3.0000','41.1519','45.2670','85.8849','90.0000'),(20170116,29,296024,11,'1.0000','61.3500','72.3930','97.4570','108.5000'),(20170310,9,32018,4,'2.0000','135.9200','149.5120','285.4080','299.0000'),(20170324,25,256584,9,'1.0000','19.1600','21.0760','26.5840','28.5000'),(20170412,17,202236,6,'1.0000','282.8600','333.7748','483.0852','534.0000'),(20170725,9,109115,4,'1.0000','404.7200','445.1920','582.5280','623.0000'),(20170912,43,296976,15,'1.0000','219.1000','241.0100','263.5900','285.5000'),(20170204,21,248755,8,'1.0000','74.5500','87.9690','144.5810','158.0000'),(20170204,17,296034,6,'3.0000','87.0300','102.6954','122.3346','138.0000'),(20171222,17,295793,7,'1.0000','11.8051','13.9300','31.8751','34.0000'),(20171027,47,54926,17,'1.0000','45.3000','49.8300','58.4700','63.0000'),(20170915,29,297849,11,'1.0000','29.8500','35.2230','64.6270','70.0000'),(20170801,3,275107,2,'1.0000','488.2000','537.0200','736.1800','785.0000'),(20170513,21,295916,8,'1.0000','125.5100','138.0610','180.4490','193.0000'),(20170103,3,241391,2,'2.0000','403.8200','444.2020','589.6180','630.0000'),(20170706,3,137763,2,'3.0000','424.0200','466.4220','514.0980','556.5000'),(20170225,29,154369,11,'1.0000','289.5300','318.4830','384.0470','413.0000'),(20170425,21,248917,8,'1.0000','155.8700','171.4570','186.4130','202.0000'),(20170415,9,48579,4,'1.0000','11.7500','12.9250','18.3250','19.5000'),(20170511,3,297971,2,'1.0000','54.4400','64.2392','90.2008','100.0000'),(20171003,33,296280,12,'1.0000','229.5000','252.4500','331.0500','354.0000'),(20170602,3,122134,1,'1.0000','295.0100','324.5110','455.4990','485.0000'),(20170907,3,85704,2,'1.0000','67.3000','74.0300','80.7700','87.5000'),(20170408,33,181096,13,'1.0000','242.4800','266.7280','349.2520','373.5000'),(20171210,9,270985,4,'6.0000','24.4200','26.8620','102.5580','105.0000'),(20171204,9,250394,4,'1.0000','59.6186','70.3500','129.2686','140.0000'),(20171219,43,94393,16,'1.0000','95.9909','105.5900','114.3009','123.9000'),(20170526,25,247019,9,'2.0000','61.1800','67.2980','133.8820','140.0000'),(20170115,3,282196,1,'1.0000','154.2300','169.6530','187.0770','202.5000'),(20171230,25,179614,9,'1.0000','157.8700','173.6570','191.7130','207.5000'),(20170510,43,298267,16,'1.0000','74.1000','81.5100','142.5900','150.0000'),(20170324,37,276932,14,'1.0000','185.0000','203.5000','220.0000','238.5000'),(20170302,9,201914,4,'1.0000','284.0000','312.4000','408.6000','437.0000'),(20170516,21,223280,8,'1.0000','13.2900','15.6822','36.6078','39.0000'),(20170412,29,308572,11,'1.0000','120.3390','142.0000','205.3390','227.0000'),(20171024,29,97072,11,'1.0000','18.4200','20.2620','43.1580','45.0000'),(20171204,3,118025,1,'1.0000','281.7800','309.9580','430.8220','459.0000'),(20171031,3,171188,1,'1.0000','21.7600','25.6768','46.0832','50.0000'),(20170702,3,25629,2,'2.0000','39.8200','43.8020','96.0180','100.0000'),(20170626,43,92557,16,'1.0000','967.6525','1141.8300','1485.8225','1660.0000'),(20170124,25,289691,9,'1.0000','203.1000','223.4100','246.6900','267.0000'),(20171117,51,92050,20,'1.0000','110.5400','121.5940','158.9460','170.0000'),(20171029,3,224089,2,'1.0000','183.8500','202.2350','264.6150','283.0000'),(20170121,17,14361,6,'1.0000','275.8600','303.4460','397.4140','425.0000'),(20171009,29,309391,11,'2.0000','43.5000','47.8500','95.6500','100.0000'),(20170701,9,190471,4,'2.0000','13.9200','15.3120','37.6080','39.0000'),(20170306,3,157050,1,'2.0000','22.7800','25.0580','29.7220','32.0000'),(20170703,3,292684,2,'1.0000','120.4500','132.4950','177.9550','190.0000'),(20171114,33,265908,12,'1.0000','351.2545','386.3800','430.3745','465.5000'),(20170810,29,267199,11,'1.0000','147.5700','162.3270','200.2430','215.0000'),(20170929,58,102861,22,'2.0000','184.6200','203.0820','225.5380','244.0000'),(20170723,33,125944,13,'1.0000','59.2727','65.2000','144.0727','150.0000'),(20170426,9,289691,4,'1.0000','211.6000','232.7600','257.8400','279.0000'),(20171110,21,90945,8,'1.0000','10.4000','11.4400','27.9600','29.0000'),(20170514,29,13817,11,'1.0000','79.1900','93.4442','125.7458','140.0000'),(20171119,37,207999,14,'2.0000','18.7000','20.5700','68.1300','70.0000'),(20171115,37,173809,14,'5.0000','37.5500','41.3050','121.2450','125.0000'),(20170207,29,276822,11,'3.0000','719.7200','791.6920','1023.0280','1095.0000'),(20171205,29,20711,11,'2.0000','398.7600','438.6360','534.1240','574.0000'),(20170910,3,226981,1,'1.0000','206.3900','227.0290','248.8610','269.5000'),(20171014,21,157694,8,'1.0000','394.0500','433.4550','567.5950','607.0000'),(20171130,29,309331,11,'1.0000','13.5593','16.0000','37.5593','40.0000'),(20170316,25,286273,9,'1.0000','154.8300','182.6994','227.1306','255.0000'),(20170912,25,157050,9,'2.0000','27.6000','30.3600','34.2400','37.0000'),(20170330,43,107494,16,'2.0000','490.5600','539.6160','710.9440','760.0000'),(20170502,9,216946,4,'1.0000','236.5900','260.2490','340.3410','364.0000'),(20170211,37,176888,14,'1.0000','137.2712','161.9800','240.2912','265.0000'),(20171213,9,278199,4,'1.0000','226.5600','249.2160','325.8440','348.5000'),(20170427,17,245423,6,'3.0000','322.2600','354.4860','462.7740','495.0000');
/*!40000 ALTER TABLE dbo.fct_cheque ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-30 16:42:42







-- SQL Server dump 10.16  Distrib 10.1.48-MariaDB, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: db
-- ------------------------------------------------------
-- Server version	10.1.48-MariaDB-0+deb9u2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table dbo.dim_cash_register
--

DROP TABLE IF EXISTS dbo.dim_cash_register;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_cash_register (
  cash_register_id tinyint DEFAULT NULL,
  cash_register_number varchar(10) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_cash_register
--

/*!40000 ALTER TABLE dbo.dim_cash_register DISABLE KEYS */;
INSERT INTO dbo.dim_cash_register VALUES (7,'касса - 7'),(1,'касса - 1'),(2,'касса - 2'),(3,'касса - 3'),(4,'касса - 4'),(5,'касса - 5'),(6,'касса - 6'),(7,'касса - 7'),(8,'касса - 8'),(9,'касса - 9'),(11,'касса - 11'),(12,'касса - 12'),(13,'касса - 13'),(14,'касса - 14'),(15,'касса - 15'),(16,'касса - 16'),(17,'касса - 17'),(18,'касса - 18'),(19,'касса - 19'),(20,'касса - 20'),(21,'касса - 21'),(22,'касса - 22'),(23,'касса - 23');
/*!40000 ALTER TABLE dbo.dim_cash_register ENABLE KEYS */;

--
-- Table structure for table dbo.dim_date
--

DROP TABLE IF EXISTS dbo.dim_date;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_date (
  d varchar(19) DEFAULT NULL,
  did int DEFAULT NULL,
  td varchar(10) DEFAULT NULL,
  y smallint DEFAULT NULL,
  ty smallint DEFAULT NULL,
  q int DEFAULT NULL,
  tq varchar(9) DEFAULT NULL,
  tqid varchar(10) DEFAULT NULL,
  m int DEFAULT NULL,
  tm varchar(8) DEFAULT NULL,
  tmid varchar(13) DEFAULT NULL,
  tms tinyint DEFAULT NULL,
  w int DEFAULT NULL,
  tw varchar(12) DEFAULT NULL,
  twid varchar(17) DEFAULT NULL,
  dw tinyint DEFAULT NULL,
  tdw varchar(11) DEFAULT NULL,
  day_type_id tinyint DEFAULT NULL,
  day_type varchar(8) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_date
--

/*!40000 ALTER TABLE dbo.dim_date DISABLE KEYS */;
INSERT INTO dbo.dim_date VALUES ('2015-01-01 00:00:00',20150101,'01.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-02 00:00:00',20150102,'02.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-03 00:00:00',20150103,'03.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',6,'Суббота',2,'Выходной'),('2015-01-04 00:00:00',20150104,'04.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-05 00:00:00',20150105,'05.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-06 00:00:00',20150106,'06.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-07 00:00:00',20150107,'07.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',3,'Среда',1,'Рабочий'),('2015-01-08 00:00:00',20150108,'08.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-09 00:00:00',20150109,'09.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-10 00:00:00',20150110,'10.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',6,'Суббота',2,'Выходной'),('2015-01-11 00:00:00',20150111,'11.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-12 00:00:00',20150112,'12.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-13 00:00:00',20150113,'13.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-14 00:00:00',20150114,'14.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',3,'Среда',1,'Рабочий'),('2015-01-15 00:00:00',20150115,'15.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-16 00:00:00',20150116,'16.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-17 00:00:00',20150117,'17.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',6,'Суббота',2,'Выходной'),('2015-01-18 00:00:00',20150118,'18.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-19 00:00:00',20150119,'19.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-20 00:00:00',20150120,'20.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-21 00:00:00',20150121,'21.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',3,'Среда',1,'Рабочий'),('2015-01-22 00:00:00',20150122,'22.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-23 00:00:00',20150123,'23.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-24 00:00:00',20150124,'24.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',6,'Суббота',2,'Выходной'),('2015-01-25 00:00:00',20150125,'25.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-26 00:00:00',20150126,'26.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-27 00:00:00',20150127,'27.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-28 00:00:00',20150128,'28.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',3,'Среда',1,'Рабочий'),('2015-01-29 00:00:00',20150129,'29.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-30 00:00:00',20150130,'30.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-31 00:00:00',20150131,'31.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',6,'Суббота',2,'Выходной'),('2015-02-01 00:00:00',20150201,'01.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201505,'04    Неделя','2015/04    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-02 00:00:00',20150202,'02.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-03 00:00:00',20150203,'03.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-04 00:00:00',20150204,'04.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',3,'Среда',1,'Рабочий'),('2015-02-05 00:00:00',20150205,'05.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-06 00:00:00',20150206,'06.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-07 00:00:00',20150207,'07.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',6,'Суббота',2,'Выходной'),('2015-02-08 00:00:00',20150208,'08.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-09 00:00:00',20150209,'09.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-10 00:00:00',20150210,'10.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-11 00:00:00',20150211,'11.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',3,'Среда',1,'Рабочий'),('2015-02-12 00:00:00',20150212,'12.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-13 00:00:00',20150213,'13.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-14 00:00:00',20150214,'14.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',6,'Суббота',2,'Выходной'),('2015-02-15 00:00:00',20150215,'15.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-16 00:00:00',20150216,'16.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-17 00:00:00',20150217,'17.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-18 00:00:00',20150218,'18.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',3,'Среда',1,'Рабочий'),('2015-02-19 00:00:00',20150219,'19.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-20 00:00:00',20150220,'20.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-21 00:00:00',20150221,'21.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',6,'Суббота',2,'Выходной'),('2015-02-22 00:00:00',20150222,'22.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-23 00:00:00',20150223,'23.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-24 00:00:00',20150224,'24.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-25 00:00:00',20150225,'25.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',3,'Среда',1,'Рабочий'),('2015-02-26 00:00:00',20150226,'26.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-27 00:00:00',20150227,'27.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-28 00:00:00',20150228,'28.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',6,'Суббота',2,'Выходной'),('2015-03-01 00:00:00',20150301,'01.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201509,'08    Неделя','2015/08    Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-02 00:00:00',20150302,'02.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-03 00:00:00',20150303,'03.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',2,'Вторник',1,'Рабочий'),('2015-03-04 00:00:00',20150304,'04.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',3,'Среда',1,'Рабочий'),('2015-03-05 00:00:00',20150305,'05.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',4,'Четверг',1,'Рабочий'),('2015-03-06 00:00:00',20150306,'06.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',5,'Пятница',1,'Рабочий'),('2015-03-07 00:00:00',20150307,'07.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',6,'Суббота',2,'Выходной'),('2015-03-08 00:00:00',20150308,'08.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-09 00:00:00',20150309,'09.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-10 00:00:00',20150310,'10.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',2,'Вторник',1,'Рабочий'),('2015-03-11 00:00:00',20150311,'11.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',3,'Среда',1,'Рабочий'),('2015-03-12 00:00:00',20150312,'12.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',4,'Четверг',1,'Рабочий'),('2015-03-13 00:00:00',20150313,'13.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',5,'Пятница',1,'Рабочий'),('2015-03-14 00:00:00',20150314,'14.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',6,'Суббота',2,'Выходной'),('2015-03-15 00:00:00',20150315,'15.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-16 00:00:00',20150316,'16.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-17 00:00:00',20150317,'17.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',2,'Вторник',1,'Рабочий'),('2015-03-18 00:00:00',20150318,'18.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',3,'Среда',1,'Рабочий'),('2015-03-19 00:00:00',20150319,'19.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',4,'Четверг',1,'Рабочий'),('2015-03-20 00:00:00',20150320,'20.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',5,'Пятница',1,'Рабочий'),('2015-03-21 00:00:00',20150321,'21.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',6,'Суббота',2,'Выходной'),('2015-03-22 00:00:00',20150322,'22.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-23 00:00:00',20150323,'23.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-24 00:00:00',20150324,'24.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',2,'Вторник',1,'Рабочий'),('2015-03-25 00:00:00',20150325,'25.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',3,'Среда',1,'Рабочий'),('2015-03-26 00:00:00',20150326,'26.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',4,'Четверг',1,'Рабочий'),('2015-03-27 00:00:00',20150327,'27.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',5,'Пятница',1,'Рабочий'),('2015-03-28 00:00:00',20150328,'28.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',6,'Суббота',2,'Выходной'),('2015-03-29 00:00:00',20150329,'29.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-30 00:00:00',20150330,'30.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201514,'13   Неделя','2015/13   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-31 00:00:00',20150331,'31.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201514,'13   Неделя','2015/13   Неделя',2,'Вторник',1,'Рабочий'),('2015-04-01 00:00:00',20150401,'01.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',3,'Среда',1,'Рабочий'),('2015-04-02 00:00:00',20150402,'02.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',4,'Четверг',1,'Рабочий'),('2015-04-03 00:00:00',20150403,'03.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',5,'Пятница',1,'Рабочий'),('2015-04-04 00:00:00',20150404,'04.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',6,'Суббота',2,'Выходной'),('2015-04-05 00:00:00',20150405,'05.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',7,'Воскресенье',2,'Выходной'),('2015-04-06 00:00:00',20150406,'06.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',1,'Понедельник',1,'Рабочий'),('2015-04-07 00:00:00',20150407,'07.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',2,'Вторник',1,'Рабочий'),('2015-04-08 00:00:00',20150408,'08.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',3,'Среда',1,'Рабочий'),('2015-04-09 00:00:00',20150409,'09.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',4,'Четверг',1,'Рабочий'),('2015-04-10 00:00:00',20150410,'10.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',5,'Пятница',1,'Рабочий');
/*!40000 ALTER TABLE dbo.dim_date ENABLE KEYS */;

--
-- Table structure for table dbo.dim_goods
--

DROP TABLE IF EXISTS dbo.dim_goods;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_goods (
  good_id int DEFAULT NULL,
  good_name varchar(144) DEFAULT NULL,
  group_id varchar(3) DEFAULT NULL,
  group_name varchar(109) DEFAULT NULL,
  parent_group_id varchar(2) DEFAULT NULL,
  parent_group_name varchar(33) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_goods
--

/*!40000 ALTER TABLE dbo.dim_goods DISABLE KEYS */;
INSERT INTO dbo.dim_goods VALUES (245427,'Виши део-ролик д/очень чувствит кожи 50мл','5','Косметические средства','',''),(102018,'Фиточай Алтайский кедр клетчатка алтайская 90х60х90 с медом 10г №15','1','Биологически активные добавки','',''),(1553,'Сироп боярышник с черноплодной рябиной на сахаре 250мл','1','Биологически активные добавки','',''),(113548,'Натура сиберика крем д/ног д/ежедневного ухода 75мл питательный увлажн  (280)','5','Косметические средства','',''),(149074,'З/паста детская Новый жемчуг женьшень 50мл','5','Косметические средства','',''),(93697,'Доктор Конфеткин с бифидобактериями 100г банан','2','Продукты питания','',''),(296413,'Эспумизан беби капли внутр. 100мг/мл 30мл №1','14','Лек. средства','',''),(309294,'Дюкрэ скванорм набор:шампунь от жирной перхоти 200мл+лосьон от перхоти 30мл','5','Косметические средства','',''),(218391,'Ко-Диротон таб. 10мг+12,5мг №30','14','Лек. средства','',''),(194687,'Освежитель д/полости рта Минторол лимон+ 25мл','5','Косметические средства','',''),(89844,'Африн экстро спрей наз. 0,05% 15мл','14','Лек. средства','',''),(29615,'Соль д/ванн мертвого моря крепкий иммунитет 530г','5','Косметические средства','',''),(40378,'Фенистил пенцивир крем 1% 2г','14','Лек. средства','',''),(341027,'Презервативы Дюрекс инвизибл ультратонкие №18','7','Контрацептивные средства','',''),(250124,'Аугментин пор. д/сусп.внутр. 125мг+31,25мг/5мл 11,5г 100мл №1','14','Лек. средства','',''),(7706,'ДП гербер пюре банан-лесные ягоды 130г 5+мес','138','Детское питание','',''),(94696,'ДП хайнц каша б/мол первая овсяная-пребиотики 180г 5+мес','138','Детское питание','',''),(194747,'Масло кедровое капс. 300мг №100','1','Биологически активные добавки','',''),(320380,'Турбослим батончик диетич клубничный чизкейк 50г','2','Продукты питания','',''),(223243,'Бинт марлевый стер 7мх14см  (инд уп)','3','Изделия медицинского назначения','',''),(260827,'Кармолис гель 145г','14','Лек. средства','',''),(205570,'Клостерфрау Мелисана эликсир 95мл','14','Лек. средства','',''),(59230,'ДП хайнц детское печеньице 6 злаков 180г  (6+мес)','138','Детское питание','',''),(243154,'Масло эфирное сосна 10мл','98','Ароматерапия','',''),(234329,'Натура сиберика вилд крем д/рук подснежник защитный 75мл','5','Косметические средства','',''),(276825,'Динолак эмульс.внутр. 200мл  (+мерн стак)','1','Биологически активные добавки','',''),(297532,'Хозтовары Тиамо губка д/тела массаж оригинал круг радуга поролон','13','Хозтовары','6','Товары неаптечного ассортимента'),(19588,'Паглюферал 3 таб. №20','14','Лек. средства','',''),(49203,'Термометр мед электрон DT-624+держатель корова','3','Изделия медицинского назначения','',''),(34407,'Драй-драй бальзам от перхоти 100мл','5','Косметические средства','',''),(36322,'Кальция глюконат р-р в/в и в/м 10% 10мл №10','14','Лек. средства','',''),(105639,'Фиточай Похудей манго 2г №30','1','Биологически активные добавки','',''),(105782,'Марля медицинская 2мх90см','3','Изделия медицинского назначения','',''),(63143,'5D 5 дней крем д/ног заживляющий масло чайного дерева 30г','5','Косметические средства','',''),(77962,'Бинт марлевый стер 10мх16см','3','Изделия медицинского назначения','',''),(296473,'Вайтсорб таб. №10','72','БАД,влиющие на процесс детоксикации,сорбенты','1','Биологически активные добавки'),(175955,'Эвкасепт капли наз. 10мл','14','Лек. средства','',''),(162954,'Фурацилин р-р д/местн. и наружн. прим. 0,02% 200мл №1','14','Лек. средства','',''),(63286,'Ихтиол мазь 10% 30г','14','Лек. средства','',''),(197601,'З/паста Элмекс защита от кариеса 75мл','5','Косметические средства','',''),(233127,'Натрия хлорид р-р д/инф. 0,9% 400мл №12','14','Лек. средства','',''),(190774,'Урьяж ксемоз крем эмольянт 200мл','5','Косметические средства','',''),(148135,'Контейнер-таблетница пилюля с делителем  (1557)','3','Изделия медицинского назначения','',''),(56316,'Зубочистки с нитью ментол №10','5','Косметические средства','',''),(199539,'Клоран лосьон д/снятия водостойкого макияжа с глаз 100мл василек  (06315)','5','Косметические средства','',''),(297412,'Нивея сан спрей солнцезащитный защита и прохлада spf30 200мл  (80476)','5','Косметические средства','',''),(86847,'Тербинафин-МФФ мазь 1% 15г','14','Лек. средства','',''),(146160,'Мыло Цветы любви сирень 90г','5','Косметические средства','',''),(76167,'Грелка термохимическая солевая лор','3','Изделия медицинского назначения','',''),(61168,'Натура сиберика гель д/душа тонизирующий 400мл  (808)','5','Косметические средства','',''),(295414,'Ментос др. жев. 16г мята','2','Продукты питания','',''),(68138,'Авен клинанс К крем себо- и кераторегулирующий 40мл  (C04290)','5','Косметические средства','',''),(36525,'Презервативы Маскулан 1 ультра тутти фрутти №10','7','Контрацептивные средства','',''),(262945,'Авент соска силикон переменный поток 3+мес №2  (80600/SCF635/27)','4','Товары для мамы и малыша','',''),(12761,'Актовегин р-р д/ин. 40мг/мл 10мл №5','14','Лек. средства','',''),(75964,'Антигриппин-максимум капс./комплект №20','14','Лек. средства','',''),(252918,'Глина черная вулканическая 75г','5','Косметические средства','',''),(207568,'Амосин пор. д/сусп.внутр. 500мг №10','14','Лек. средства','',''),(796,'Лайно гель д/душа персик 200мл','5','Косметические средства','',''),(295617,'Триметазидин МВ таб.пролонг.п.п.о. 35мг №30','14','Лек. средства','',''),(135254,'Органик шоп соль д/ванн коралловые водоросли 250мл','5','Косметические средства','',''),(224362,'5D 5 дней ср-во д/стоп от пота и запаха 1,5г №10','5','Косметические средства','',''),(177750,'Биокрим масло д/загара цветочная фантазия 150мл','5','Косметические средства','',''),(74905,'Вода минеральная Ессентуки N17 500мл  (газ стекло)','2','Продукты питания','',''),(309354,'Витэкс идеальное отбеливание крем дневной spf 20 50мл','5','Косметические средства','',''),(308438,'Тест на беременность Клиаблу easy №1','3','Изделия медицинского назначения','',''),(161099,'Меллер конфета жев Шоколад-мята 38г','2','Продукты питания','',''),(179868,'АЦЦ гран. д/р-ра внутр. 600мг 3г №6','14','Лек. средства','',''),(284734,'Масло эфирное иланг-иланг 10мл','98','Ароматерапия','',''),(297592,'З/паста Колгейт тотал 12 про здоровое дыхание 75мл','105','Средства ухода за полостью рта','5','Косметические средства'),(341170,'ДНЦ крем-концентрат воск д/рук 80мл','5','Косметические средства','',''),(18589,'Преднизолон Никомед р-р д/ин. 25мг/мл 1мл №3','14','Лек. средства','',''),(256831,'Нейронтин таб. п.о 600мг №100','14','Лек. средства','',''),(295534,'Обувь ортопедическая Sydney N32','3','Изделия медицинского назначения','',''),(293499,'Барсукор бальзам-крем массажный д/детей с барсучьим жиром 50мл','5','Косметические средства','',''),(6827,'ДП бабушкино лукошко сок осветлен б/сах яблоко-груша 200мл 5+мес','138','Детское питание','',''),(309414,'БиоТоника батончик энерджайзер горький апельсин 20г','2','Продукты питания','',''),(270854,'Флюкостат капс. 50мг №7','14','Лек. средства','',''),(84076,'Офлоксацин-тева таб. п.п.о. 200мг №10','14','Лек. средства','',''),(290645,'Система д/переливания инфузионных растворов','3','Изделия медицинского назначения','',''),(320297,'Прокладки Олвейс платинум ультра нормал плюс N8','8','Товары санитарии и личной гигиены','',''),(295474,'Обувь ортопедическая Forli N24','3','Изделия медицинского назначения','',''),(341087,'Бандаж послеоперационный абдоминальный БПАШ XXL широкий 25см  (116-128см)','3','Изделия медицинского назначения','',''),(91819,'Орунгамин капс. 100мг №15','14','Лек. средства','',''),(111550,'Мовалис р-р в/м 15мг/1,5мл 1,5мл №3','14','Лек. средства','',''),(25582,'Пантенол Виал спрей бальзам косметический 58г','5','Косметические средства','',''),(92901,'Комплимент натуралис молочко д/лица антивозрастной виноград-масло пшеницы 250мл','5','Косметические средства','',''),(294498,'Беруши (вкладыши ушные) Макс акваблок от воды N2 рельефные прозрачные','3','Изделия медицинского назначения','',''),(131401,'Нэйчес баунти омега-3 капс. 980мг №30','1','Биологически активные добавки','',''),(19611,'Женьшень настойка 25мл','14','Лек. средства','',''),(271793,'Тромбовазим капс. 800ЕД №30','14','Лек. средства','',''),(166071,'Биодерма нодэ шампунь 400мл','5','Косметические средства','',''),(53199,'Виши тан идеаль/teint ideal крем тональный 25 30мл  (M7766100)','5','Косметические средства','',''),(40498,'Амброксол Врамед сироп 15мг/5мл 100мл №1','14','Лек. средства','',''),(122493,'Акку-чек актив глюкометр набор+тест-полоски N10','3','Изделия медицинского назначения','',''),(286566,'Бипрол таб. п.п.о. 10мг №30','14','Лек. средства','',''),(157163,'Зингер триммер  (zo-SLС-703)','6','Товары неаптечного ассортимента','',''),(115749,'Баня сауна массаж гель-душ+шампунь березовый 300мл','5','Косметические средства','',''),(166950,'Пектилифт гель д/зрелой кожи курс 1нед 50мл','5','Косметические средства','',''),(37501,'Мыло невское 4х100г','5','Косметические средства','','');
/*!40000 ALTER TABLE dbo.dim_goods ENABLE KEYS */;

--
-- Table structure for table dbo.dim_stores
--

DROP TABLE IF EXISTS dbo.dim_stores;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_stores (
  store_id tinyint DEFAULT NULL,
  store_name varchar(11) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_stores
--

/*!40000 ALTER TABLE dbo.dim_stores DISABLE KEYS */;
INSERT INTO dbo.dim_stores VALUES (1,'Аптека - 1'),(2,'Аптека - 2'),(3,'Аптека - 3'),(4,'Аптека - 4'),(5,'Аптека - 5'),(6,'Аптека - 6'),(7,'Аптека - 7'),(8,'Аптека - 8'),(9,'Аптека - 9'),(10,'Аптека - 10'),(11,'Аптека - 11'),(12,'Аптека - 12'),(13,'Аптека - 13'),(14,'Аптека - 14'),(15,'Аптека - 15'),(16,'Аптека - 16'),(17,'Аптека - 17'),(18,'Аптека - 18'),(19,'Аптека - 19'),(20,'Аптека - 20'),(21,'Аптека - 21'),(22,'Аптека - 22'),(23,'Аптека - 23'),(24,'Аптека - 24'),(25,'Аптека - 25'),(26,'Аптека - 26'),(27,'Аптека - 27'),(28,'Аптека - 28'),(29,'Аптека - 29'),(30,'Аптека - 30'),(31,'Аптека - 31'),(32,'Аптека - 32'),(33,'Аптека - 33'),(34,'Аптека - 34'),(35,'Аптека - 35'),(36,'Аптека - 36'),(37,'Аптека - 37'),(38,'Аптека - 38'),(39,'Аптека - 39'),(40,'Аптека - 40'),(41,'Аптека - 41'),(42,'Аптека - 42'),(43,'Аптека - 43'),(44,'Аптека - 44'),(45,'Аптека - 45'),(46,'Аптека - 46'),(48,'Аптека - 48'),(49,'Аптека - 49'),(50,'Аптека - 50'),(51,'Аптека - 51'),(52,'Аптека - 52'),(53,'Аптека - 53'),(54,'Аптека - 54'),(55,'Аптека - 55'),(56,'Аптека - 56'),(57,'Аптека - 57'),(58,'Аптека - 58');
/*!40000 ALTER TABLE dbo.dim_stores ENABLE KEYS */;

--
-- Table structure for table dbo.fct_cheque
--

DROP TABLE IF EXISTS dbo.fct_cheque;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.fct_cheque (
  date_id int DEFAULT NULL,
  store_id tinyint DEFAULT NULL,
  good_id int DEFAULT NULL,
  cash_register_id tinyint DEFAULT NULL,
  quantity varchar(9) DEFAULT NULL,
  cost_net varchar(10) DEFAULT NULL,
  cost_grs varchar(10) DEFAULT NULL,
  sale_net varchar(10) DEFAULT NULL,
  sale_grs varchar(10) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.fct_cheque
--

/*!40000 ALTER TABLE dbo.fct_cheque DISABLE KEYS */;
INSERT INTO dbo.fct_cheque VALUES (20171003,9,227133,4,'4.0000','160.9200','177.0120','247.9080','264.0000'),(20170829,9,144760,4,'1.0000','49.1364','54.0500','102.5864','107.5000'),(20170912,17,171541,6,'1.0000','93.6091','102.9700','133.6391','143.0000'),(20170729,9,124003,4,'1.0000','53.5400','58.8940','74.1460','79.5000'),(20170403,33,136177,12,'1.0000','16.5600','19.5409','47.0191','50.0000'),(20171115,33,166292,13,'1.0000','670.1455','737.1601','928.9854','996.0000'),(20170902,29,30154,11,'1.0000','136.1000','149.7100','196.3900','210.0000'),(20170915,3,148366,1,'1.0000','71.8000','78.9800','86.3200','93.5000'),(20170928,21,212635,8,'1.0000','168.3000','185.1300','238.1700','255.0000'),(20170526,25,149585,9,'2.0000','88.8800','104.8784','194.0016','210.0000'),(20171122,9,308462,4,'2.0000','34.9082','38.3990','86.5092','90.0000'),(20170307,9,189284,4,'1.0000','7.5800','8.9444','11.1356','12.5000'),(20170614,25,46226,10,'1.0000','125.7800','138.3580','182.4220','195.0000'),(20170728,33,296994,13,'1.0000','114.1277','125.5405','138.5872','150.0000'),(20170217,29,193634,11,'1.0000','249.1000','274.0100','358.5900','383.5000'),(20170202,9,199335,4,'1.0000','270.1100','297.1210','388.4890','415.5000'),(20171017,29,59997,11,'2.0000','76.2372','89.9598','136.2774','150.0000'),(20170215,21,105725,8,'3.0000','18.6600','20.5260','61.1340','63.0000'),(20171103,9,295916,4,'1.0000','123.5555','135.9110','177.6445','190.0000'),(20170103,21,211953,8,'1.0000','23.4800','25.8280','54.6520','57.0000'),(20170623,9,120383,4,'1.0000','160.4800','176.5280','230.9520','247.0000'),(20170801,21,191646,8,'1.0000','186.0600','204.6660','257.3940','276.0000'),(20170215,9,12607,4,'1.0000','33.2000','36.5200','76.6800','80.0000'),(20171025,43,114866,16,'4.0000','25.8644','30.5200','55.3444','60.0000'),(20170428,17,63606,6,'1.0000','510.9200','562.0120','707.9080','759.0000'),(20171013,3,227133,2,'1.0000','42.1900','46.4090','70.7810','75.0000'),(20170801,17,245423,7,'1.0000','107.4200','118.1620','154.2580','165.0000'),(20171019,58,127426,22,'1.0000','66.8034','78.8280','105.9754','118.0000'),(20171214,17,292311,6,'1.0000','303.6636','334.0300','435.6336','466.0000'),(20170620,25,24530,9,'1.0000','196.7500','216.4250','285.3250','305.0000'),(20170824,37,245423,14,'1.0000','107.4200','118.1620','174.2580','185.0000'),(20170804,3,122882,1,'3.0000','41.1519','45.2670','85.8849','90.0000'),(20170116,29,296024,11,'1.0000','61.3500','72.3930','97.4570','108.5000'),(20170310,9,32018,4,'2.0000','135.9200','149.5120','285.4080','299.0000'),(20170324,25,256584,9,'1.0000','19.1600','21.0760','26.5840','28.5000'),(20170412,17,202236,6,'1.0000','282.8600','333.7748','483.0852','534.0000'),(20170725,9,109115,4,'1.0000','404.7200','445.1920','582.5280','623.0000'),(20170912,43,296976,15,'1.0000','219.1000','241.0100','263.5900','285.5000'),(20170204,21,248755,8,'1.0000','74.5500','87.9690','144.5810','158.0000'),(20170204,17,296034,6,'3.0000','87.0300','102.6954','122.3346','138.0000'),(20171222,17,295793,7,'1.0000','11.8051','13.9300','31.8751','34.0000'),(20171027,47,54926,17,'1.0000','45.3000','49.8300','58.4700','63.0000'),(20170915,29,297849,11,'1.0000','29.8500','35.2230','64.6270','70.0000'),(20170801,3,275107,2,'1.0000','488.2000','537.0200','736.1800','785.0000'),(20170513,21,295916,8,'1.0000','125.5100','138.0610','180.4490','193.0000'),(20170103,3,241391,2,'2.0000','403.8200','444.2020','589.6180','630.0000'),(20170706,3,137763,2,'3.0000','424.0200','466.4220','514.0980','556.5000'),(20170225,29,154369,11,'1.0000','289.5300','318.4830','384.0470','413.0000'),(20170425,21,248917,8,'1.0000','155.8700','171.4570','186.4130','202.0000'),(20170415,9,48579,4,'1.0000','11.7500','12.9250','18.3250','19.5000'),(20170511,3,297971,2,'1.0000','54.4400','64.2392','90.2008','100.0000'),(20171003,33,296280,12,'1.0000','229.5000','252.4500','331.0500','354.0000'),(20170602,3,122134,1,'1.0000','295.0100','324.5110','455.4990','485.0000'),(20170907,3,85704,2,'1.0000','67.3000','74.0300','80.7700','87.5000'),(20170408,33,181096,13,'1.0000','242.4800','266.7280','349.2520','373.5000'),(20171210,9,270985,4,'6.0000','24.4200','26.8620','102.5580','105.0000'),(20171204,9,250394,4,'1.0000','59.6186','70.3500','129.2686','140.0000'),(20171219,43,94393,16,'1.0000','95.9909','105.5900','114.3009','123.9000'),(20170526,25,247019,9,'2.0000','61.1800','67.2980','133.8820','140.0000'),(20170115,3,282196,1,'1.0000','154.2300','169.6530','187.0770','202.5000'),(20171230,25,179614,9,'1.0000','157.8700','173.6570','191.7130','207.5000'),(20170510,43,298267,16,'1.0000','74.1000','81.5100','142.5900','150.0000'),(20170324,37,276932,14,'1.0000','185.0000','203.5000','220.0000','238.5000'),(20170302,9,201914,4,'1.0000','284.0000','312.4000','408.6000','437.0000'),(20170516,21,223280,8,'1.0000','13.2900','15.6822','36.6078','39.0000'),(20170412,29,308572,11,'1.0000','120.3390','142.0000','205.3390','227.0000'),(20171024,29,97072,11,'1.0000','18.4200','20.2620','43.1580','45.0000'),(20171204,3,118025,1,'1.0000','281.7800','309.9580','430.8220','459.0000'),(20171031,3,171188,1,'1.0000','21.7600','25.6768','46.0832','50.0000'),(20170702,3,25629,2,'2.0000','39.8200','43.8020','96.0180','100.0000'),(20170626,43,92557,16,'1.0000','967.6525','1141.8300','1485.8225','1660.0000'),(20170124,25,289691,9,'1.0000','203.1000','223.4100','246.6900','267.0000'),(20171117,51,92050,20,'1.0000','110.5400','121.5940','158.9460','170.0000'),(20171029,3,224089,2,'1.0000','183.8500','202.2350','264.6150','283.0000'),(20170121,17,14361,6,'1.0000','275.8600','303.4460','397.4140','425.0000'),(20171009,29,309391,11,'2.0000','43.5000','47.8500','95.6500','100.0000'),(20170701,9,190471,4,'2.0000','13.9200','15.3120','37.6080','39.0000'),(20170306,3,157050,1,'2.0000','22.7800','25.0580','29.7220','32.0000'),(20170703,3,292684,2,'1.0000','120.4500','132.4950','177.9550','190.0000'),(20171114,33,265908,12,'1.0000','351.2545','386.3800','430.3745','465.5000'),(20170810,29,267199,11,'1.0000','147.5700','162.3270','200.2430','215.0000'),(20170929,58,102861,22,'2.0000','184.6200','203.0820','225.5380','244.0000'),(20170723,33,125944,13,'1.0000','59.2727','65.2000','144.0727','150.0000'),(20170426,9,289691,4,'1.0000','211.6000','232.7600','257.8400','279.0000'),(20171110,21,90945,8,'1.0000','10.4000','11.4400','27.9600','29.0000'),(20170514,29,13817,11,'1.0000','79.1900','93.4442','125.7458','140.0000'),(20171119,37,207999,14,'2.0000','18.7000','20.5700','68.1300','70.0000'),(20171115,37,173809,14,'5.0000','37.5500','41.3050','121.2450','125.0000'),(20170207,29,276822,11,'3.0000','719.7200','791.6920','1023.0280','1095.0000'),(20171205,29,20711,11,'2.0000','398.7600','438.6360','534.1240','574.0000'),(20170910,3,226981,1,'1.0000','206.3900','227.0290','248.8610','269.5000'),(20171014,21,157694,8,'1.0000','394.0500','433.4550','567.5950','607.0000'),(20171130,29,309331,11,'1.0000','13.5593','16.0000','37.5593','40.0000'),(20170316,25,286273,9,'1.0000','154.8300','182.6994','227.1306','255.0000'),(20170912,25,157050,9,'2.0000','27.6000','30.3600','34.2400','37.0000'),(20170330,43,107494,16,'2.0000','490.5600','539.6160','710.9440','760.0000'),(20170502,9,216946,4,'1.0000','236.5900','260.2490','340.3410','364.0000'),(20170211,37,176888,14,'1.0000','137.2712','161.9800','240.2912','265.0000'),(20171213,9,278199,4,'1.0000','226.5600','249.2160','325.8440','348.5000'),(20170427,17,245423,6,'3.0000','322.2600','354.4860','462.7740','495.0000');
/*!40000 ALTER TABLE dbo.fct_cheque ENABLE KEYS */;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-30 16:42:42







DROP TABLE IF EXISTS dbo.dim_cash_register;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_cash_register (
  cash_register_id tinyint DEFAULT NULL,
  cash_register_number varchar(10) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_cash_register
--

/*!40000 ALTER TABLE dbo.dim_cash_register DISABLE KEYS */;
INSERT INTO dbo.dim_cash_register VALUES (7,'касса - 7'),(1,'касса - 1'),(2,'касса - 2'),(3,'касса - 3'),(4,'касса - 4'),(5,'касса - 5'),(6,'касса - 6'),(7,'касса - 7'),(8,'касса - 8'),(9,'касса - 9'),(11,'касса - 11'),(12,'касса - 12'),(13,'касса - 13'),(14,'касса - 14'),(15,'касса - 15'),(16,'касса - 16'),(17,'касса - 17'),(18,'касса - 18'),(19,'касса - 19'),(20,'касса - 20'),(21,'касса - 21'),(22,'касса - 22'),(23,'касса - 23');
/*!40000 ALTER TABLE dbo.dim_cash_register ENABLE KEYS */;

--
-- Table structure for table dbo.dim_date
--

DROP TABLE IF EXISTS dbo.dim_date;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_date (
  d varchar(19) DEFAULT NULL,
  did int DEFAULT NULL,
  td varchar(10) DEFAULT NULL,
  y smallint DEFAULT NULL,
  ty smallint DEFAULT NULL,
  q int DEFAULT NULL,
  tq varchar(9) DEFAULT NULL,
  tqid varchar(10) DEFAULT NULL,
  m int DEFAULT NULL,
  tm varchar(8) DEFAULT NULL,
  tmid varchar(13) DEFAULT NULL,
  tms tinyint DEFAULT NULL,
  w int DEFAULT NULL,
  tw varchar(12) DEFAULT NULL,
  twid varchar(17) DEFAULT NULL,
  dw tinyint DEFAULT NULL,
  tdw varchar(11) DEFAULT NULL,
  day_type_id tinyint DEFAULT NULL,
  day_type varchar(8) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_date
--

/*!40000 ALTER TABLE dbo.dim_date DISABLE KEYS */;
INSERT INTO dbo.dim_date VALUES ('2015-01-01 00:00:00',20150101,'01.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-02 00:00:00',20150102,'02.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-03 00:00:00',20150103,'03.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',6,'Суббота',2,'Выходной'),('2015-01-04 00:00:00',20150104,'04.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201501,'00    Неделя','2015/00    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-05 00:00:00',20150105,'05.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-06 00:00:00',20150106,'06.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-07 00:00:00',20150107,'07.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',3,'Среда',1,'Рабочий'),('2015-01-08 00:00:00',20150108,'08.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-09 00:00:00',20150109,'09.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-10 00:00:00',20150110,'10.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',6,'Суббота',2,'Выходной'),('2015-01-11 00:00:00',20150111,'11.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201502,'01    Неделя','2015/01    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-12 00:00:00',20150112,'12.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-13 00:00:00',20150113,'13.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-14 00:00:00',20150114,'14.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',3,'Среда',1,'Рабочий'),('2015-01-15 00:00:00',20150115,'15.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-16 00:00:00',20150116,'16.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-17 00:00:00',20150117,'17.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',6,'Суббота',2,'Выходной'),('2015-01-18 00:00:00',20150118,'18.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201503,'02    Неделя','2015/02    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-19 00:00:00',20150119,'19.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-20 00:00:00',20150120,'20.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-21 00:00:00',20150121,'21.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',3,'Среда',1,'Рабочий'),('2015-01-22 00:00:00',20150122,'22.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-23 00:00:00',20150123,'23.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-24 00:00:00',20150124,'24.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',6,'Суббота',2,'Выходной'),('2015-01-25 00:00:00',20150125,'25.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201504,'03    Неделя','2015/03    Неделя',7,'Воскресенье',2,'Выходной'),('2015-01-26 00:00:00',20150126,'26.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',1,'Понедельник',1,'Рабочий'),('2015-01-27 00:00:00',20150127,'27.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',2,'Вторник',1,'Рабочий'),('2015-01-28 00:00:00',20150128,'28.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',3,'Среда',1,'Рабочий'),('2015-01-29 00:00:00',20150129,'29.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',4,'Четверг',1,'Рабочий'),('2015-01-30 00:00:00',20150130,'30.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',5,'Пятница',1,'Рабочий'),('2015-01-31 00:00:00',20150131,'31.01.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201501,'Январь','2015/Январь',1,201505,'04    Неделя','2015/04    Неделя',6,'Суббота',2,'Выходной'),('2015-02-01 00:00:00',20150201,'01.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201505,'04    Неделя','2015/04    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-02 00:00:00',20150202,'02.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-03 00:00:00',20150203,'03.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-04 00:00:00',20150204,'04.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',3,'Среда',1,'Рабочий'),('2015-02-05 00:00:00',20150205,'05.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-06 00:00:00',20150206,'06.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-07 00:00:00',20150207,'07.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',6,'Суббота',2,'Выходной'),('2015-02-08 00:00:00',20150208,'08.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201506,'05    Неделя','2015/05    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-09 00:00:00',20150209,'09.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-10 00:00:00',20150210,'10.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-11 00:00:00',20150211,'11.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',3,'Среда',1,'Рабочий'),('2015-02-12 00:00:00',20150212,'12.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-13 00:00:00',20150213,'13.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-14 00:00:00',20150214,'14.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',6,'Суббота',2,'Выходной'),('2015-02-15 00:00:00',20150215,'15.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201507,'06    Неделя','2015/06    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-16 00:00:00',20150216,'16.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-17 00:00:00',20150217,'17.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-18 00:00:00',20150218,'18.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',3,'Среда',1,'Рабочий'),('2015-02-19 00:00:00',20150219,'19.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-20 00:00:00',20150220,'20.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-21 00:00:00',20150221,'21.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',6,'Суббота',2,'Выходной'),('2015-02-22 00:00:00',20150222,'22.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201508,'07    Неделя','2015/07    Неделя',7,'Воскресенье',2,'Выходной'),('2015-02-23 00:00:00',20150223,'23.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',1,'Понедельник',1,'Рабочий'),('2015-02-24 00:00:00',20150224,'24.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',2,'Вторник',1,'Рабочий'),('2015-02-25 00:00:00',20150225,'25.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',3,'Среда',1,'Рабочий'),('2015-02-26 00:00:00',20150226,'26.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',4,'Четверг',1,'Рабочий'),('2015-02-27 00:00:00',20150227,'27.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',5,'Пятница',1,'Рабочий'),('2015-02-28 00:00:00',20150228,'28.02.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201502,'Февраль','2015/Февраль',2,201509,'08    Неделя','2015/08    Неделя',6,'Суббота',2,'Выходной'),('2015-03-01 00:00:00',20150301,'01.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201509,'08    Неделя','2015/08    Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-02 00:00:00',20150302,'02.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-03 00:00:00',20150303,'03.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',2,'Вторник',1,'Рабочий'),('2015-03-04 00:00:00',20150304,'04.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',3,'Среда',1,'Рабочий'),('2015-03-05 00:00:00',20150305,'05.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',4,'Четверг',1,'Рабочий'),('2015-03-06 00:00:00',20150306,'06.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',5,'Пятница',1,'Рабочий'),('2015-03-07 00:00:00',20150307,'07.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',6,'Суббота',2,'Выходной'),('2015-03-08 00:00:00',20150308,'08.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201510,'09    Неделя','2015/09    Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-09 00:00:00',20150309,'09.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-10 00:00:00',20150310,'10.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',2,'Вторник',1,'Рабочий'),('2015-03-11 00:00:00',20150311,'11.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',3,'Среда',1,'Рабочий'),('2015-03-12 00:00:00',20150312,'12.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',4,'Четверг',1,'Рабочий'),('2015-03-13 00:00:00',20150313,'13.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',5,'Пятница',1,'Рабочий'),('2015-03-14 00:00:00',20150314,'14.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',6,'Суббота',2,'Выходной'),('2015-03-15 00:00:00',20150315,'15.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201511,'10   Неделя','2015/10   Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-16 00:00:00',20150316,'16.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-17 00:00:00',20150317,'17.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',2,'Вторник',1,'Рабочий'),('2015-03-18 00:00:00',20150318,'18.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',3,'Среда',1,'Рабочий'),('2015-03-19 00:00:00',20150319,'19.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',4,'Четверг',1,'Рабочий'),('2015-03-20 00:00:00',20150320,'20.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',5,'Пятница',1,'Рабочий'),('2015-03-21 00:00:00',20150321,'21.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',6,'Суббота',2,'Выходной'),('2015-03-22 00:00:00',20150322,'22.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201512,'11   Неделя','2015/11   Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-23 00:00:00',20150323,'23.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-24 00:00:00',20150324,'24.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',2,'Вторник',1,'Рабочий'),('2015-03-25 00:00:00',20150325,'25.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',3,'Среда',1,'Рабочий'),('2015-03-26 00:00:00',20150326,'26.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',4,'Четверг',1,'Рабочий'),('2015-03-27 00:00:00',20150327,'27.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',5,'Пятница',1,'Рабочий'),('2015-03-28 00:00:00',20150328,'28.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',6,'Суббота',2,'Выходной'),('2015-03-29 00:00:00',20150329,'29.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201513,'12   Неделя','2015/12   Неделя',7,'Воскресенье',2,'Выходной'),('2015-03-30 00:00:00',20150330,'30.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201514,'13   Неделя','2015/13   Неделя',1,'Понедельник',1,'Рабочий'),('2015-03-31 00:00:00',20150331,'31.03.2015',2015,2015,20151,'1 квартал','2015/1 Кв.',201503,'Март','2015/Март',3,201514,'13   Неделя','2015/13   Неделя',2,'Вторник',1,'Рабочий'),('2015-04-01 00:00:00',20150401,'01.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',3,'Среда',1,'Рабочий'),('2015-04-02 00:00:00',20150402,'02.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',4,'Четверг',1,'Рабочий'),('2015-04-03 00:00:00',20150403,'03.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',5,'Пятница',1,'Рабочий'),('2015-04-04 00:00:00',20150404,'04.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',6,'Суббота',2,'Выходной'),('2015-04-05 00:00:00',20150405,'05.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201514,'13   Неделя','2015/13   Неделя',7,'Воскресенье',2,'Выходной'),('2015-04-06 00:00:00',20150406,'06.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',1,'Понедельник',1,'Рабочий'),('2015-04-07 00:00:00',20150407,'07.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',2,'Вторник',1,'Рабочий'),('2015-04-08 00:00:00',20150408,'08.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',3,'Среда',1,'Рабочий'),('2015-04-09 00:00:00',20150409,'09.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',4,'Четверг',1,'Рабочий'),('2015-04-10 00:00:00',20150410,'10.04.2015',2015,2015,20152,'2 квартал','2015/2 Кв.',201504,'Апрель','2015/Апрель',4,201515,'14   Неделя','2015/14   Неделя',5,'Пятница',1,'Рабочий');
/*!40000 ALTER TABLE dbo.dim_date ENABLE KEYS */;

--
-- Table structure for table dbo.dim_goods
--

DROP TABLE IF EXISTS dbo.dim_goods;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_goods (
  good_id int DEFAULT NULL,
  good_name varchar(144) DEFAULT NULL,
  group_id varchar(3) DEFAULT NULL,
  group_name varchar(109) DEFAULT NULL,
  parent_group_id varchar(2) DEFAULT NULL,
  parent_group_name varchar(33) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_goods
--

/*!40000 ALTER TABLE dbo.dim_goods DISABLE KEYS */;
INSERT INTO dbo.dim_goods VALUES (245427,'Виши део-ролик д/очень чувствит кожи 50мл','5','Косметические средства','',''),(102018,'Фиточай Алтайский кедр клетчатка алтайская 90х60х90 с медом 10г №15','1','Биологически активные добавки','',''),(1553,'Сироп боярышник с черноплодной рябиной на сахаре 250мл','1','Биологически активные добавки','',''),(113548,'Натура сиберика крем д/ног д/ежедневного ухода 75мл питательный увлажн  (280)','5','Косметические средства','',''),(149074,'З/паста детская Новый жемчуг женьшень 50мл','5','Косметические средства','',''),(93697,'Доктор Конфеткин с бифидобактериями 100г банан','2','Продукты питания','',''),(296413,'Эспумизан беби капли внутр. 100мг/мл 30мл №1','14','Лек. средства','',''),(309294,'Дюкрэ скванорм набор:шампунь от жирной перхоти 200мл+лосьон от перхоти 30мл','5','Косметические средства','',''),(218391,'Ко-Диротон таб. 10мг+12,5мг №30','14','Лек. средства','',''),(194687,'Освежитель д/полости рта Минторол лимон+ 25мл','5','Косметические средства','',''),(89844,'Африн экстро спрей наз. 0,05% 15мл','14','Лек. средства','',''),(29615,'Соль д/ванн мертвого моря крепкий иммунитет 530г','5','Косметические средства','',''),(40378,'Фенистил пенцивир крем 1% 2г','14','Лек. средства','',''),(341027,'Презервативы Дюрекс инвизибл ультратонкие №18','7','Контрацептивные средства','',''),(250124,'Аугментин пор. д/сусп.внутр. 125мг+31,25мг/5мл 11,5г 100мл №1','14','Лек. средства','',''),(7706,'ДП гербер пюре банан-лесные ягоды 130г 5+мес','138','Детское питание','',''),(94696,'ДП хайнц каша б/мол первая овсяная-пребиотики 180г 5+мес','138','Детское питание','',''),(194747,'Масло кедровое капс. 300мг №100','1','Биологически активные добавки','',''),(320380,'Турбослим батончик диетич клубничный чизкейк 50г','2','Продукты питания','',''),(223243,'Бинт марлевый стер 7мх14см  (инд уп)','3','Изделия медицинского назначения','',''),(260827,'Кармолис гель 145г','14','Лек. средства','',''),(205570,'Клостерфрау Мелисана эликсир 95мл','14','Лек. средства','',''),(59230,'ДП хайнц детское печеньице 6 злаков 180г  (6+мес)','138','Детское питание','',''),(243154,'Масло эфирное сосна 10мл','98','Ароматерапия','',''),(234329,'Натура сиберика вилд крем д/рук подснежник защитный 75мл','5','Косметические средства','',''),(276825,'Динолак эмульс.внутр. 200мл  (+мерн стак)','1','Биологически активные добавки','',''),(297532,'Хозтовары Тиамо губка д/тела массаж оригинал круг радуга поролон','13','Хозтовары','6','Товары неаптечного ассортимента'),(19588,'Паглюферал 3 таб. №20','14','Лек. средства','',''),(49203,'Термометр мед электрон DT-624+держатель корова','3','Изделия медицинского назначения','',''),(34407,'Драй-драй бальзам от перхоти 100мл','5','Косметические средства','',''),(36322,'Кальция глюконат р-р в/в и в/м 10% 10мл №10','14','Лек. средства','',''),(105639,'Фиточай Похудей манго 2г №30','1','Биологически активные добавки','',''),(105782,'Марля медицинская 2мх90см','3','Изделия медицинского назначения','',''),(63143,'5D 5 дней крем д/ног заживляющий масло чайного дерева 30г','5','Косметические средства','',''),(77962,'Бинт марлевый стер 10мх16см','3','Изделия медицинского назначения','',''),(296473,'Вайтсорб таб. №10','72','БАД,влиющие на процесс детоксикации,сорбенты','1','Биологически активные добавки'),(175955,'Эвкасепт капли наз. 10мл','14','Лек. средства','',''),(162954,'Фурацилин р-р д/местн. и наружн. прим. 0,02% 200мл №1','14','Лек. средства','',''),(63286,'Ихтиол мазь 10% 30г','14','Лек. средства','',''),(197601,'З/паста Элмекс защита от кариеса 75мл','5','Косметические средства','',''),(233127,'Натрия хлорид р-р д/инф. 0,9% 400мл №12','14','Лек. средства','',''),(190774,'Урьяж ксемоз крем эмольянт 200мл','5','Косметические средства','',''),(148135,'Контейнер-таблетница пилюля с делителем  (1557)','3','Изделия медицинского назначения','',''),(56316,'Зубочистки с нитью ментол №10','5','Косметические средства','',''),(199539,'Клоран лосьон д/снятия водостойкого макияжа с глаз 100мл василек  (06315)','5','Косметические средства','',''),(297412,'Нивея сан спрей солнцезащитный защита и прохлада spf30 200мл  (80476)','5','Косметические средства','',''),(86847,'Тербинафин-МФФ мазь 1% 15г','14','Лек. средства','',''),(146160,'Мыло Цветы любви сирень 90г','5','Косметические средства','',''),(76167,'Грелка термохимическая солевая лор','3','Изделия медицинского назначения','',''),(61168,'Натура сиберика гель д/душа тонизирующий 400мл  (808)','5','Косметические средства','',''),(295414,'Ментос др. жев. 16г мята','2','Продукты питания','',''),(68138,'Авен клинанс К крем себо- и кераторегулирующий 40мл  (C04290)','5','Косметические средства','',''),(36525,'Презервативы Маскулан 1 ультра тутти фрутти №10','7','Контрацептивные средства','',''),(262945,'Авент соска силикон переменный поток 3+мес №2  (80600/SCF635/27)','4','Товары для мамы и малыша','',''),(12761,'Актовегин р-р д/ин. 40мг/мл 10мл №5','14','Лек. средства','',''),(75964,'Антигриппин-максимум капс./комплект №20','14','Лек. средства','',''),(252918,'Глина черная вулканическая 75г','5','Косметические средства','',''),(207568,'Амосин пор. д/сусп.внутр. 500мг №10','14','Лек. средства','',''),(796,'Лайно гель д/душа персик 200мл','5','Косметические средства','',''),(295617,'Триметазидин МВ таб.пролонг.п.п.о. 35мг №30','14','Лек. средства','',''),(135254,'Органик шоп соль д/ванн коралловые водоросли 250мл','5','Косметические средства','',''),(224362,'5D 5 дней ср-во д/стоп от пота и запаха 1,5г №10','5','Косметические средства','',''),(177750,'Биокрим масло д/загара цветочная фантазия 150мл','5','Косметические средства','',''),(74905,'Вода минеральная Ессентуки N17 500мл  (газ стекло)','2','Продукты питания','',''),(309354,'Витэкс идеальное отбеливание крем дневной spf 20 50мл','5','Косметические средства','',''),(308438,'Тест на беременность Клиаблу easy №1','3','Изделия медицинского назначения','',''),(161099,'Меллер конфета жев Шоколад-мята 38г','2','Продукты питания','',''),(179868,'АЦЦ гран. д/р-ра внутр. 600мг 3г №6','14','Лек. средства','',''),(284734,'Масло эфирное иланг-иланг 10мл','98','Ароматерапия','',''),(297592,'З/паста Колгейт тотал 12 про здоровое дыхание 75мл','105','Средства ухода за полостью рта','5','Косметические средства'),(341170,'ДНЦ крем-концентрат воск д/рук 80мл','5','Косметические средства','',''),(18589,'Преднизолон Никомед р-р д/ин. 25мг/мл 1мл №3','14','Лек. средства','',''),(256831,'Нейронтин таб. п.о 600мг №100','14','Лек. средства','',''),(295534,'Обувь ортопедическая Sydney N32','3','Изделия медицинского назначения','',''),(293499,'Барсукор бальзам-крем массажный д/детей с барсучьим жиром 50мл','5','Косметические средства','',''),(6827,'ДП бабушкино лукошко сок осветлен б/сах яблоко-груша 200мл 5+мес','138','Детское питание','',''),(309414,'БиоТоника батончик энерджайзер горький апельсин 20г','2','Продукты питания','',''),(270854,'Флюкостат капс. 50мг №7','14','Лек. средства','',''),(84076,'Офлоксацин-тева таб. п.п.о. 200мг №10','14','Лек. средства','',''),(290645,'Система д/переливания инфузионных растворов','3','Изделия медицинского назначения','',''),(320297,'Прокладки Олвейс платинум ультра нормал плюс N8','8','Товары санитарии и личной гигиены','',''),(295474,'Обувь ортопедическая Forli N24','3','Изделия медицинского назначения','',''),(341087,'Бандаж послеоперационный абдоминальный БПАШ XXL широкий 25см  (116-128см)','3','Изделия медицинского назначения','',''),(91819,'Орунгамин капс. 100мг №15','14','Лек. средства','',''),(111550,'Мовалис р-р в/м 15мг/1,5мл 1,5мл №3','14','Лек. средства','',''),(25582,'Пантенол Виал спрей бальзам косметический 58г','5','Косметические средства','',''),(92901,'Комплимент натуралис молочко д/лица антивозрастной виноград-масло пшеницы 250мл','5','Косметические средства','',''),(294498,'Беруши (вкладыши ушные) Макс акваблок от воды N2 рельефные прозрачные','3','Изделия медицинского назначения','',''),(131401,'Нэйчес баунти омега-3 капс. 980мг №30','1','Биологически активные добавки','',''),(19611,'Женьшень настойка 25мл','14','Лек. средства','',''),(271793,'Тромбовазим капс. 800ЕД №30','14','Лек. средства','',''),(166071,'Биодерма нодэ шампунь 400мл','5','Косметические средства','',''),(53199,'Виши тан идеаль/teint ideal крем тональный 25 30мл  (M7766100)','5','Косметические средства','',''),(40498,'Амброксол Врамед сироп 15мг/5мл 100мл №1','14','Лек. средства','',''),(122493,'Акку-чек актив глюкометр набор+тест-полоски N10','3','Изделия медицинского назначения','',''),(286566,'Бипрол таб. п.п.о. 10мг №30','14','Лек. средства','',''),(157163,'Зингер триммер  (zo-SLС-703)','6','Товары неаптечного ассортимента','',''),(115749,'Баня сауна массаж гель-душ+шампунь березовый 300мл','5','Косметические средства','',''),(166950,'Пектилифт гель д/зрелой кожи курс 1нед 50мл','5','Косметические средства','',''),(37501,'Мыло невское 4х100г','5','Косметические средства','','');
/*!40000 ALTER TABLE dbo.dim_goods ENABLE KEYS */;

--
-- Table structure for table dbo.dim_stores
--

DROP TABLE IF EXISTS dbo.dim_stores;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.dim_stores (
  store_id tinyint DEFAULT NULL,
  store_name varchar(11) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.dim_stores
--

/*!40000 ALTER TABLE dbo.dim_stores DISABLE KEYS */;
INSERT INTO dbo.dim_stores VALUES (1,'Аптека - 1'),(2,'Аптека - 2'),(3,'Аптека - 3'),(4,'Аптека - 4'),(5,'Аптека - 5'),(6,'Аптека - 6'),(7,'Аптека - 7'),(8,'Аптека - 8'),(9,'Аптека - 9'),(10,'Аптека - 10'),(11,'Аптека - 11'),(12,'Аптека - 12'),(13,'Аптека - 13'),(14,'Аптека - 14'),(15,'Аптека - 15'),(16,'Аптека - 16'),(17,'Аптека - 17'),(18,'Аптека - 18'),(19,'Аптека - 19'),(20,'Аптека - 20'),(21,'Аптека - 21'),(22,'Аптека - 22'),(23,'Аптека - 23'),(24,'Аптека - 24'),(25,'Аптека - 25'),(26,'Аптека - 26'),(27,'Аптека - 27'),(28,'Аптека - 28'),(29,'Аптека - 29'),(30,'Аптека - 30'),(31,'Аптека - 31'),(32,'Аптека - 32'),(33,'Аптека - 33'),(34,'Аптека - 34'),(35,'Аптека - 35'),(36,'Аптека - 36'),(37,'Аптека - 37'),(38,'Аптека - 38'),(39,'Аптека - 39'),(40,'Аптека - 40'),(41,'Аптека - 41'),(42,'Аптека - 42'),(43,'Аптека - 43'),(44,'Аптека - 44'),(45,'Аптека - 45'),(46,'Аптека - 46'),(48,'Аптека - 48'),(49,'Аптека - 49'),(50,'Аптека - 50'),(51,'Аптека - 51'),(52,'Аптека - 52'),(53,'Аптека - 53'),(54,'Аптека - 54'),(55,'Аптека - 55'),(56,'Аптека - 56'),(57,'Аптека - 57'),(58,'Аптека - 58');
/*!40000 ALTER TABLE dbo.dim_stores ENABLE KEYS */;

--
-- Table structure for table dbo.fct_cheque
--

DROP TABLE IF EXISTS dbo.fct_cheque;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE dbo.fct_cheque (
  date_id int DEFAULT NULL,
  store_id tinyint DEFAULT NULL,
  good_id int DEFAULT NULL,
  cash_register_id tinyint DEFAULT NULL,
  quantity varchar(9) DEFAULT NULL,
  cost_net varchar(10) DEFAULT NULL,
  cost_grs varchar(10) DEFAULT NULL,
  sale_net varchar(10) DEFAULT NULL,
  sale_grs varchar(10) DEFAULT NULL
);
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table dbo.fct_cheque
--

/*!40000 ALTER TABLE dbo.fct_cheque DISABLE KEYS */;
INSERT INTO dbo.fct_cheque VALUES (20171003,9,227133,4,'4.0000','160.9200','177.0120','247.9080','264.0000'),(20170829,9,144760,4,'1.0000','49.1364','54.0500','102.5864','107.5000'),(20170912,17,171541,6,'1.0000','93.6091','102.9700','133.6391','143.0000'),(20170729,9,124003,4,'1.0000','53.5400','58.8940','74.1460','79.5000'),(20170403,33,136177,12,'1.0000','16.5600','19.5409','47.0191','50.0000'),(20171115,33,166292,13,'1.0000','670.1455','737.1601','928.9854','996.0000'),(20170902,29,30154,11,'1.0000','136.1000','149.7100','196.3900','210.0000'),(20170915,3,148366,1,'1.0000','71.8000','78.9800','86.3200','93.5000'),(20170928,21,212635,8,'1.0000','168.3000','185.1300','238.1700','255.0000'),(20170526,25,149585,9,'2.0000','88.8800','104.8784','194.0016','210.0000'),(20171122,9,308462,4,'2.0000','34.9082','38.3990','86.5092','90.0000'),(20170307,9,189284,4,'1.0000','7.5800','8.9444','11.1356','12.5000'),(20170614,25,46226,10,'1.0000','125.7800','138.3580','182.4220','195.0000'),(20170728,33,296994,13,'1.0000','114.1277','125.5405','138.5872','150.0000'),(20170217,29,193634,11,'1.0000','249.1000','274.0100','358.5900','383.5000'),(20170202,9,199335,4,'1.0000','270.1100','297.1210','388.4890','415.5000'),(20171017,29,59997,11,'2.0000','76.2372','89.9598','136.2774','150.0000'),(20170215,21,105725,8,'3.0000','18.6600','20.5260','61.1340','63.0000'),(20171103,9,295916,4,'1.0000','123.5555','135.9110','177.6445','190.0000'),(20170103,21,211953,8,'1.0000','23.4800','25.8280','54.6520','57.0000'),(20170623,9,120383,4,'1.0000','160.4800','176.5280','230.9520','247.0000'),(20170801,21,191646,8,'1.0000','186.0600','204.6660','257.3940','276.0000'),(20170215,9,12607,4,'1.0000','33.2000','36.5200','76.6800','80.0000'),(20171025,43,114866,16,'4.0000','25.8644','30.5200','55.3444','60.0000'),(20170428,17,63606,6,'1.0000','510.9200','562.0120','707.9080','759.0000'),(20171013,3,227133,2,'1.0000','42.1900','46.4090','70.7810','75.0000'),(20170801,17,245423,7,'1.0000','107.4200','118.1620','154.2580','165.0000'),(20171019,58,127426,22,'1.0000','66.8034','78.8280','105.9754','118.0000'),(20171214,17,292311,6,'1.0000','303.6636','334.0300','435.6336','466.0000'),(20170620,25,24530,9,'1.0000','196.7500','216.4250','285.3250','305.0000'),(20170824,37,245423,14,'1.0000','107.4200','118.1620','174.2580','185.0000'),(20170804,3,122882,1,'3.0000','41.1519','45.2670','85.8849','90.0000'),(20170116,29,296024,11,'1.0000','61.3500','72.3930','97.4570','108.5000'),(20170310,9,32018,4,'2.0000','135.9200','149.5120','285.4080','299.0000'),(20170324,25,256584,9,'1.0000','19.1600','21.0760','26.5840','28.5000'),(20170412,17,202236,6,'1.0000','282.8600','333.7748','483.0852','534.0000'),(20170725,9,109115,4,'1.0000','404.7200','445.1920','582.5280','623.0000'),(20170912,43,296976,15,'1.0000','219.1000','241.0100','263.5900','285.5000'),(20170204,21,248755,8,'1.0000','74.5500','87.9690','144.5810','158.0000'),(20170204,17,296034,6,'3.0000','87.0300','102.6954','122.3346','138.0000'),(20171222,17,295793,7,'1.0000','11.8051','13.9300','31.8751','34.0000'),(20171027,47,54926,17,'1.0000','45.3000','49.8300','58.4700','63.0000'),(20170915,29,297849,11,'1.0000','29.8500','35.2230','64.6270','70.0000'),(20170801,3,275107,2,'1.0000','488.2000','537.0200','736.1800','785.0000'),(20170513,21,295916,8,'1.0000','125.5100','138.0610','180.4490','193.0000'),(20170103,3,241391,2,'2.0000','403.8200','444.2020','589.6180','630.0000'),(20170706,3,137763,2,'3.0000','424.0200','466.4220','514.0980','556.5000'),(20170225,29,154369,11,'1.0000','289.5300','318.4830','384.0470','413.0000'),(20170425,21,248917,8,'1.0000','155.8700','171.4570','186.4130','202.0000'),(20170415,9,48579,4,'1.0000','11.7500','12.9250','18.3250','19.5000'),(20170511,3,297971,2,'1.0000','54.4400','64.2392','90.2008','100.0000'),(20171003,33,296280,12,'1.0000','229.5000','252.4500','331.0500','354.0000'),(20170602,3,122134,1,'1.0000','295.0100','324.5110','455.4990','485.0000'),(20170907,3,85704,2,'1.0000','67.3000','74.0300','80.7700','87.5000'),(20170408,33,181096,13,'1.0000','242.4800','266.7280','349.2520','373.5000'),(20171210,9,270985,4,'6.0000','24.4200','26.8620','102.5580','105.0000'),(20171204,9,250394,4,'1.0000','59.6186','70.3500','129.2686','140.0000'),(20171219,43,94393,16,'1.0000','95.9909','105.5900','114.3009','123.9000'),(20170526,25,247019,9,'2.0000','61.1800','67.2980','133.8820','140.0000'),(20170115,3,282196,1,'1.0000','154.2300','169.6530','187.0770','202.5000'),(20171230,25,179614,9,'1.0000','157.8700','173.6570','191.7130','207.5000'),(20170510,43,298267,16,'1.0000','74.1000','81.5100','142.5900','150.0000'),(20170324,37,276932,14,'1.0000','185.0000','203.5000','220.0000','238.5000'),(20170302,9,201914,4,'1.0000','284.0000','312.4000','408.6000','437.0000'),(20170516,21,223280,8,'1.0000','13.2900','15.6822','36.6078','39.0000'),(20170412,29,308572,11,'1.0000','120.3390','142.0000','205.3390','227.0000'),(20171024,29,97072,11,'1.0000','18.4200','20.2620','43.1580','45.0000'),(20171204,3,118025,1,'1.0000','281.7800','309.9580','430.8220','459.0000'),(20171031,3,171188,1,'1.0000','21.7600','25.6768','46.0832','50.0000'),(20170702,3,25629,2,'2.0000','39.8200','43.8020','96.0180','100.0000'),(20170626,43,92557,16,'1.0000','967.6525','1141.8300','1485.8225','1660.0000'),(20170124,25,289691,9,'1.0000','203.1000','223.4100','246.6900','267.0000'),(20171117,51,92050,20,'1.0000','110.5400','121.5940','158.9460','170.0000'),(20171029,3,224089,2,'1.0000','183.8500','202.2350','264.6150','283.0000'),(20170121,17,14361,6,'1.0000','275.8600','303.4460','397.4140','425.0000'),(20171009,29,309391,11,'2.0000','43.5000','47.8500','95.6500','100.0000'),(20170701,9,190471,4,'2.0000','13.9200','15.3120','37.6080','39.0000'),(20170306,3,157050,1,'2.0000','22.7800','25.0580','29.7220','32.0000'),(20170703,3,292684,2,'1.0000','120.4500','132.4950','177.9550','190.0000'),(20171114,33,265908,12,'1.0000','351.2545','386.3800','430.3745','465.5000'),(20170810,29,267199,11,'1.0000','147.5700','162.3270','200.2430','215.0000'),(20170929,58,102861,22,'2.0000','184.6200','203.0820','225.5380','244.0000'),(20170723,33,125944,13,'1.0000','59.2727','65.2000','144.0727','150.0000'),(20170426,9,289691,4,'1.0000','211.6000','232.7600','257.8400','279.0000'),(20171110,21,90945,8,'1.0000','10.4000','11.4400','27.9600','29.0000'),(20170514,29,13817,11,'1.0000','79.1900','93.4442','125.7458','140.0000'),(20171119,37,207999,14,'2.0000','18.7000','20.5700','68.1300','70.0000'),(20171115,37,173809,14,'5.0000','37.5500','41.3050','121.2450','125.0000'),(20170207,29,276822,11,'3.0000','719.7200','791.6920','1023.0280','1095.0000'),(20171205,29,20711,11,'2.0000','398.7600','438.6360','534.1240','574.0000'),(20170910,3,226981,1,'1.0000','206.3900','227.0290','248.8610','269.5000'),(20171014,21,157694,8,'1.0000','394.0500','433.4550','567.5950','607.0000'),(20171130,29,309331,11,'1.0000','13.5593','16.0000','37.5593','40.0000'),(20170316,25,286273,9,'1.0000','154.8300','182.6994','227.1306','255.0000'),(20170912,25,157050,9,'2.0000','27.6000','30.3600','34.2400','37.0000'),(20170330,43,107494,16,'2.0000','490.5600','539.6160','710.9440','760.0000'),(20170502,9,216946,4,'1.0000','236.5900','260.2490','340.3410','364.0000'),(20170211,37,176888,14,'1.0000','137.2712','161.9800','240.2912','265.0000'),(20171213,9,278199,4,'1.0000','226.5600','249.2160','325.8440','348.5000'),(20170427,17,245423,6,'3.0000','322.2600','354.4860','462.7740','495.0000');
/*!40000 ALTER TABLE dbo.fct_cheque ENABLE KEYS */;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;










-- Процедура для расчета показателей продаж и выявления расхождений
DELIMITER //

CREATE PROCEDURE sp_report_1 (
    IN @date_from DATE,
    IN @date_to DATE,
    IN @good_group_name VARCHAR(109)
)
BEGIN
    -- Объявление переменных
    DECLARE v_total_sale_grs DECIMAL(10,2);
    DECLARE v_total_quantity DECIMAL(10,2);

    -- Выборка данных по продажам
    SELECT 
        SUM(CAST(sale_grs AS DECIMAL(10,2))) INTO v_total_sale_grs,
        SUM(CAST(quantity AS DECIMAL(10,2))) INTO v_total_quantity
    FROM fct_cheque
    JOIN dim_goods ON fct_cheque.good_id = dim_goods.good_id
    JOIN dim_date ON fct_cheque.date_id = dim_date.did
    WHERE dim_date.d BETWEEN @date_from AND @date_to
    AND dim_goods.group_name = @good_group_name;

    -- Вывод результатов и сообщение о расхождениях
    SELECT 
        v_total_sale_grs AS total_sale_grs,
        v_total_quantity AS total_quantity;

    IF v_total_sale_grs != 1782949.1 OR v_total_quantity != 6761.1 THEN
        SELECT 'Расхождение в данных о продажах!' AS message;
    END IF;

END //

DELIMITER ;


-- Процедура для добавления новых показателей в отчет
DELIMITER //

CREATE PROCEDURE sp_report_2 (
    IN @date_from DATE,
    IN @date_to DATE,
    IN @good_group_name VARCHAR(109)
)
BEGIN
    -- Создание временной таблицы для хранения результатов
    CREATE TEMPORARY TABLE temp_report AS
    SELECT
        dd.d AS sales_date,
        dg.good_name,
        dg.group_name,
        SUM(CAST(fc.quantity AS DECIMAL(10,2))) AS total_quantity,
        SUM(CAST(fc.sale_grs AS DECIMAL(10,2))) AS total_sale_grs,
        SUM(CAST(fc.cost_net AS DECIMAL(10,2))) AS total_cost_net
    FROM fct_cheque fc
    JOIN dim_goods dg ON fc.good_id = dg.good_id
    JOIN dim_date dd ON fc.date_id = dd.did
    WHERE dd.d BETWEEN @date_from AND @date_to
    AND dg.group_name = @good_group_name
    GROUP BY 1,2,3;

    -- Добавление рассчитанных показателей
    ALTER TABLE temp_report
    ADD COLUMN avg_purchase_price_net DECIMAL(10,2),
    ADD COLUMN margin_net DECIMAL(10,2),
    ADD COLUMN markup_percent_net DECIMAL(10,2);

    UPDATE temp_report
    SET avg_purchase_price_net = CASE WHEN total_quantity > 0 THEN total_cost_net / total_quantity ELSE 0 END,
        margin_net = total_sale_grs - total_cost_net,
        markup_percent_net = CASE WHEN total_cost_net > 0 THEN (total_sale_grs - total_cost_net) / total_cost_net * 100 ELSE 0 END;

    -- Вывод отчета
    SELECT * FROM temp_report;

    -- Удаление временной таблицы
    DROP TABLE temp_report;
END //

DELIMITER ;

-- Пример запуска процедуры для задания 1
CALL sp_report_1('2017-06-01', '2017-06-30', 'Биологически активные добавки');

-- Пример запуска процедуры для задания 2
CALL sp_report_2('2017-06-01', '2017-06-30', 'Биологически активные добавки');

DELIMITER //

-- Задание 3: Фильтрация по нескольким группам товаров
CREATE PROCEDURE sp_report_1 (
    IN @date_from DATE,
    IN @date_to DATE,
    IN @good_group_names VARCHAR(255)
)
BEGIN
    DECLARE v_total_sale_grs DECIMAL(18,2);
    DECLARE v_total_quantity DECIMAL(18,2);
    DECLARE v_group_name VARCHAR(109);
    DECLARE done INT DEFAULT FALSE;
    DECLARE cur CURSOR FOR SELECT group_name FROM dim_goods WHERE group_name IN (SELECT value FROM str_split(@good_group_names, ','));
    DECLARE CONTINUE HANDLER FOR NOT FOUND SET done = TRUE;

    SET v_total_sale_grs = 0;
    SET v_total_quantity = 0;

    OPEN cur;
    read_loop: LOOP
        FETCH cur INTO v_group_name;
        IF done THEN
            LEAVE read_loop;
        END IF;
        SELECT 
            SUM(CAST(sale_grs AS DECIMAL(18,2))) INTO @v_sale,
            SUM(CAST(quantity AS DECIMAL(18,2))) INTO @v_quantity
        FROM fct_cheque fc
        JOIN dim_goods dg ON fc.good_id = dg.good_id
        JOIN dim_date dd ON fc.date_id = dd.did
        WHERE dd.d BETWEEN @date_from AND @date_to
        AND dg.group_name = v_group_name;

        SET v_total_sale_grs = v_total_sale_grs + @v_sale;
        SET v_total_quantity = v_total_quantity + @v_quantity;

    END LOOP;
    CLOSE cur;

    SELECT v_total_sale_grs, v_total_quantity;
END //


DELIMITER ;


-- Задание 4: Доля продаж по дням/магазинам/группам товаров
DELIMITER //

CREATE PROCEDURE sp_report_4 (
    IN @date_from DATE,
    IN @date_to DATE
)
BEGIN
    SELECT
        dd.td AS sales_date,
        ds.store_name,
        dg.group_name,
        SUM(CAST(fc.sale_grs AS DECIMAL(18,2))) AS daily_sales_grs,
        (SUM(CAST(fc.sale_grs AS DECIMAL(18,2))) / (SELECT SUM(CAST(sale_grs AS DECIMAL(18,2))) FROM fct_cheque fc2 JOIN dim_date dd2 ON fc2.date_id = dd2.did WHERE dd2.d BETWEEN @date_from AND @date_to) ) * 100 AS sales_share_percent
    FROM fct_cheque fc
    JOIN dim_goods dg ON fc.good_id = dg.good_id
    JOIN dim_date dd ON fc.date_id = dd.did
    JOIN dim_stores ds ON fc.store_id = ds.store_id
    WHERE dd.d BETWEEN @date_from AND @date_to
    GROUP BY 1,2,3
    ORDER BY sales_share_percent DESC;

END //

DELIMITER ;

-- вспомогательная функция для разбиения строки на массив значений
DELIMITER //
CREATE FUNCTION str_split(x VARCHAR(255), delim VARCHAR(12))
RETURNS SET OF VARCHAR(12)
BEGIN
  DECLARE i INT DEFAULT 1;
  DECLARE result VARCHAR(12);
  DECLARE pos INT DEFAULT 1;
  DECLARE len INT;

  SET len = LENGTH(x);

  WHILE i <= len DO
    SET pos = LOCATE(delim, SUBSTRING(x, i));
    IF pos = 0 THEN
      SET result = SUBSTRING(x, i);
      SET i = i + LENGTH(result);
    ELSE
      SET result = SUBSTRING(x, i, pos - 1);
      SET i = i + LENGTH(result) + LENGTH(delim);
    END IF;
    RETURN NEXT result;
  END WHILE;
  RETURN;
END //
DELIMITER ;



CREATE PROCEDURE GetSalesShareWithVAT
AS
BEGIN
    WITH DailySales AS (
        SELECT
            dd.d AS SalesDate,
            ds.store_name AS StoreName,
            dg.group_name AS GoodsGroupName,
            SUM(CAST(fc.sale_grs AS DECIMAL(10,2))) AS TotalSalesAmountWithVAT
        FROM
            fct_cheque fc
        JOIN
            dim_date dd ON fc.date_id = dd.did
        JOIN
            dim_stores ds ON fc.store_id = ds.store_id
        JOIN
            dim_goods dg ON fc.good_id = dg.good_id
        GROUP BY
            dd.d,
            ds.store_name,
            dg.group_name
    ),
    TotalDailySales AS (
        SELECT
            SalesDate,
            StoreName,
            SUM(TotalSalesAmountWithVAT) AS TotalDailySalesWithVAT
        FROM
            DailySales
        GROUP BY
            SalesDate,
            StoreName
    )
    SELECT
        ds.SalesDate,
        ds.StoreName,
        ds.GoodsGroupName,
        ds.TotalSalesAmountWithVAT,
        (ds.TotalSalesAmountWithVAT / ISNULL(tds.TotalDailySalesWithVAT, 1)) * 100 AS SalesShareWithVATPercentage
    FROM
        DailySales ds
    LEFT JOIN
        TotalDailySales tds ON ds.SalesDate = tds.SalesDate AND ds.StoreName = tds.StoreName
    ORDER BY
        SalesShareWithVATPercentage DESC;
END;
